<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'System Message' => 'ข้อความจากระบบ',

	'config_notfound' => 'ไม่พบไฟล์กำหนดค่า "config_global.php" หรือเข้าถึงไฟล์ไม่ได้ โปรดตรวจสอบว่าคุณได้ติดตั้งโปรแกรมอย่างถูกต้องแล้ว',
	'template_notfound' => 'ไม่พบไฟล์เทมเพลตหรือเข้าถึงไฟล์ไม่ได้',
	'directory_notfound' => 'ไม่พบไดเรกทอรีหรือเข้าถึงไดเรกทอรีไม่ได้',
	'request_tainting' => 'คำขอการเข้าถึงปัจจุบันของคุณประกอบด้วยอักขระที่ไม่ได้รับอนุญาต และถูกระบบปฏิเสธแล้ว',
	'db_help_link' => 'คลิกที่นี่เพื่อขอความช่วยเหลือ',
	'db_error_message' => 'ข้อความแสดงข้อผิดพลาด',
	'db_error_sql' => '<b>SQL</b>: $sql<br />',
	'db_error_backtrace' => '<b>Backtrace</b>: $backtrace<br />',
	'db_error_no' => 'รหัสข้อผิดพลาด',
	'db_notfound_config' => 'ไม่พบไฟล์กำหนดค่า "config_global.php" หรือเข้าถึงไฟล์ไม่ได้',
	'db_notconnect' => 'ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ฐานข้อมูลได้',
	'db_security_error' => 'พบความเสี่ยงด้านความปลอดภัยในคำสั่ง Query',
	'db_query_sql' => 'คำสั่ง Query',
	'db_query_error' => 'คำสั่ง Query ผิดพลาด',
	'db_config_db_not_found' => 'การกำหนดค่าฐานข้อมูลผิดพลาด โปรดตรวจสอบไฟล์ config_global.php อย่างละเอียด',
	'system_init_ok' => 'เริ่มต้นระบบเว็บไซต์เสร็จสมบูรณ์ โปรด <a href="index.php">คลิกที่นี่</a> เพื่อเข้าสู่เว็บไซต์',
	'backtrace' => 'ข้อมูลการรันระบบ',
	'error_end_message_user' => 'เว็บไซต์ได้บันทึกรายละเอียดข้อผิดพลาดนี้ไว้เรียบร้อยแล้ว ขออภัยในความไม่สะดวกในการเข้าใช้งานครับ<br /><a href="http://{host}">{host}</a>',
	'error_end_message_admin' => 'เว็บไซต์ได้บันทึกรายละเอียดข้อผิดพลาดนี้ไว้เรียบร้อยแล้ว คุณสามารถใช้ BackTraceID ค้นหาในเมนู "บันทึกการทำงาน > ข้อผิดพลาดระบบ" ที่หลังบ้านเพื่อตรวจสอบปัญหาอย่างรวดเร็ว<br /><a href="http://{host}">{host}</a>',
	'suggestion' => 'แนะนำให้คุณลองรีเฟรชหน้าเว็บ หรือปิดหน้าต่างเบราว์เซอร์ทั้งหมดแล้วลองดำเนินการใหม่อีกครั้ง',
	'suggestion_user' => 'หากยังไม่สามารถแก้ไขได้ โปรดแจ้งปัญหานี้ให้ผู้ดูแลระบบทราบพร้อมระบุ BackTraceID เพื่อความรวดเร็วในการตรวจสอบครับ',
	'suggestion_plugin' => 'แนะนำให้คุณลองปิดปลั๊กอิน <span class="guess">{guess}</span> ในศูนย์จัดการระบบ หากปัญหาหายไปหลังจากปิดปลั๊กอิน โปรดติดต่อผู้พัฒนาปลั๊กอินดังกล่าวพร้อมแนบภาพหน้าจอเพื่อขอความช่วยเหลือ',
	'suggestion_admin' => 'หากยังไม่สามารถแก้ไขได้ โปรดเตรียมภาพหน้าจอที่ครบถ้วนเพื่อขอความช่วยเหลือผ่านทาง <a href="https://www.dismall.com/" target="_blank">เว็บบอร์ดทางการของ Discuz!</a> หรือ <a href="https://gitee.com/discuz/DiscuzX/issues" target="_blank">ส่ง Issue</a> ใน Git repository หลักของเราครับ',

	'file_upload_error_-101' => 'อัปโหลดไม่สำเร็จ! ไม่พบไฟล์หรือไฟล์ไม่ถูกต้อง โปรดลองใหม่อีกครั้ง',
	'file_upload_error_-102' => 'อัปโหลดไม่สำเร็จ! ไฟล์ไม่ใช่ประเภทรูปภาพ โปรดลองใหม่อีกครั้ง',
	'file_upload_error_-103' => 'อัปโหลดไม่สำเร็จ! ไม่สามารถเขียนไฟล์ลงระบบได้ โปรดลองใหม่อีกครั้ง',
	'file_upload_error_-104' => 'อัปโหลดไม่สำเร็จ! ไม่รองรับรูปแบบไฟล์รูปภาพนี้ โปรดลองใหม่อีกครั้ง',
	];

