<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = [
	'การประเมินกระทู้',
	'การให้เรตติ้งโพสต์',
	'หัวข้อเรตติ้งเริ่มต้น',
	'แก้ไขโพสต์',
	'นามสกุลไฟล์แนบ',
	'รูปภาพไฟล์แนบ',
	'รหัสมัลติมีเดีย',
	'รูปย่อ',
	'ใส่ลายน้ำ',
	'ระดับสิทธิ์การอ่าน',
	'สถานะซ่อนตัว',
	'โอนเครดิต',
	'การติดตาม',
	'ข้อความส่วนตัว',
	'รหัส HTML',
	'ค้นหาเนื้อหาทั้งหมด',
	'ชื่อตำแหน่งกำหนดเอง',
	'จำกัดช่วงเวลา',
	'คำถามยืนยันตัวตน',
	'คำถามความปลอดภัย',
	'วิธีเข้าสู่ระบบ',
	'จำนวนตัวอักษรสูงสุด',
	'คลังกระทู้',
	'ปกปิดตัวตน',
	'ระดับสิทธิ์การอ่าน',
	'[hide]',
	'รหัสมัลติมีเดีย',
	'การประเมินกระทู้',
	'ขนาดไฟล์แนบ',
	'ประเภทไฟล์แนบ',
	'สร้างกิจกรรม',
	'กระทู้พิเศษ',
	'ซื้อรหัสเชิญ',
	'ข้อมูลหมวดหมู่',
	'เปิดโหมดรายการรูปภาพ',
	'แสดงแถบข้าง',
	'สัมประสิทธิ์แคชหน้าเว็บ',
	'เก็บกระทู้เข้าคลัง',
	'กระทู้แนะนำ',
	'รหัส Discuz!',
	'ป้องกันการดูดข้อมูล',
	'การตอบกลับแนะนำ',
	'อีเมลความปลอดภัย',
	'เบอร์มือถือความปลอดภัย',
	'แลกเปลี่ยนเครดิต',
	'เข้ารหัสข้อมูลละเอียดอ่อน',
	'เครื่องมือแก้ไขข้อความ',
];