<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'interthread_name' => 'โฆษณาแถบยาวระหว่างโพสต์ในบอร์ด/วงใน',
	'interthread_desc' => 'รูปแบบการแสดงผล: แสดงอยู่ระหว่างโพสต์หลัก (เจ้าของกระทู้) และโพสต์ตอบกลับแรก มักใช้รูปภาพขนาด 468x60 หรือขนาดอื่น ๆ รวมถึง Flash<br />หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงเพียงหนึ่งรายการ การวิเคราะห์ความคุ้มค่า: เนื่องจากช่วยแยกเนื้อหากระทู้ออกจากโพสต์ตอบกลับ และมีขนาดใหญ่โดยไม่กระทบต่อเนื้อหาโพสต์ จึงไม่ทำให้เจ้าของกระทู้หรือผู้เข้าชมรู้สึกรำคาญ เหมาะสำหรับการประชาสัมพันธ์เชิงพาณิชย์หรือการโปรโมทแบรนด์ภายในกระทู้',
	'interthread_fids' => 'บอร์ดที่ลงโฆษณา',
	'interthread_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'interthread_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'interthread_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'interthread_pnumber' => 'ชั้นที่แสดงโฆษณา',
	'interthread_pnumber_comment' => 'ตัวเลือก #1 #2 #3 ... หมายถึงลำดับชั้นของโพสต์ในกระทู้ สามารถกด CTRL ค้างไว้เพื่อเลือกหลายตำแหน่ง ค่าเริ่มต้นจะแสดงเฉพาะชั้นที่ 1',
	];

