<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'thread_name' => 'โฆษณาภายในโพสต์ บอร์ด/วงใน',
	'thread_desc' => 'รูปแบบการแสดงผล: โฆษณาภายในโพสต์จะแสดงที่ด้านบน ด้านล่าง หรือด้านขวาของเนื้อหาโพสต์ โดยด้านบนและด้านล่างมักใช้รูปแบบข้อความ ส่วนด้านขวามักใช้รูปแบบรูปภาพ หากมีโฆษณาภายในโพสต์หลายรายการ ระบบจะสุ่มเลือกมาแสดงตามจำนวนโพสต์ที่มีในหน้านั้น คุณสามารถแก้ไขจำนวนโฆษณาที่จะแสดงต่อหนึ่งโพสต์ได้ที่การตั้งค่าอื่น ๆ ในส่วนการตั้งค่าทั่วไป<br />การวิเคราะห์ความคุ้มค่า: เนื่องจากกระทู้เป็นหัวใจหลักของเว็บบอร์ด โฆษณาที่ฝังอยู่ในเนื้อหาจึงถูกผู้ใช้รับรู้ได้อย่างเป็นธรรมชาติในขณะอ่าน ร่วมกับการสุ่มแสดงผล ทำให้เหมาะสำหรับการโปรโมทเนื้อหาเฉพาะทางอย่างมีประสิทธิภาพ และยังใช้สำหรับการประชาสัมพันธ์หรือประกาศของเว็บบอร์ดเองได้ แนะนำให้ตั้งค่าโฆษณาไว้หลายรายการเพื่อให้เนื้อหาเกิดความแตกต่างและดึงดูดความสนใจได้มากขึ้น',
	'thread_fids' => 'บอร์ดที่ลงโฆษณา',
	'thread_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'thread_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'thread_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'thread_position' => 'ตำแหน่งโฆษณา',
	'thread_position_comment' => 'โฆษณาด้านบนและด้านล่างของเนื้อหาโพสต์เหมาะสำหรับรูปแบบข้อความ ส่วนโฆษณาด้านขวาเหมาะสำหรับรูปภาพหรือ Flash และยังสามารถแสดงโฆษณาข้อความหลายรายการพร้อมกันได้',
	'thread_position_bottom' => 'ด้านล่างโพสต์',
	'thread_position_top' => 'ด้านบนโพสต์',
	'thread_position_right' => 'ด้านขวาโพสต์',
	'thread_pnumber' => 'ชั้นที่แสดงโฆษณา',
	'thread_pnumber_comment' => 'ตัวเลือก #1 #2 #3 ... หมายถึงลำดับชั้นของโพสต์ในกระทู้ สามารถกด CTRL ค้างไว้เพื่อเลือกหลายตำแหน่ง',
	'thread_pnumber_all' => 'ทั้งหมด',
	];

