<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'footerbanner_name' => 'โฆษณาแถบยาวส่วนท้ายทั่วไป',
	'footerbanner_desc' => 'รูปแบบการแสดงผล: แสดงที่ด้านล่างของหน้าเว็บ มักใช้รูปภาพขนาด 1200x60 หรือขนาดอื่น ๆ รวมถึง Flash หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงเพียงหนึ่งรายการ<br />การวิเคราะห์ความคุ้มค่า: เมื่อเทียบกับส่วนหัวและส่วนกลางของหน้าเว็บ ส่วนท้ายจะมีโอกาสถูกมองเห็นน้อยกว่าเล็กน้อย จึงไม่ค่อยสร้างความรำคาญให้กับผู้เข้าชม ในขณะเดียวกันก็สามารถเข้าถึงกลุ่มเป้าหมายที่สนใจเนื้อหาโฆษณาจริง ๆ ได้ครบถ้วน เหมาะสำหรับการโปรโมทที่ต้องการภาพลักษณ์ที่เป็นกลางและนุ่มนวล',
	'footerbanner_index' => 'หน้าแรก',
	'footerbanner_fids' => 'บอร์ดที่ลงโฆษณา',
	'footerbanner_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'footerbanner_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'footerbanner_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'footerbanner_position' => 'ตำแหน่งโฆษณา',
	'footerbanner_position_comment' => 'แบ่งเป็น 3 ตำแหน่ง คือ บน กลาง และล่าง เมื่อโฆษณาตัวบนหมดอายุหรือถูกลบ โฆษณาตัวล่างจะเลื่อนขึ้นมาแทนที่โดยอัตโนมัติ',
	'footerbanner_position_up' => 'บน',
	'footerbanner_position_middle' => 'กลาง',
	'footerbanner_position_down' => 'ล่าง',
	'footerbanner_category' => 'หมวดหมู่พอร์ทัลที่ลงโฆษณา',
	'footerbanner_category_comment' => 'ตั้งค่าหมวดหมู่บทความที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "พอร์ทัล" ไว้ด้วย',
	];

