<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'intercat_name' => 'โฆษณาระหว่างหมวดหมู่เว็บบอร์ด',
	'intercat_desc' => 'รูปแบบการแสดงผล: แสดงอยู่ระหว่างหมวดหมู่บอร์ดที่อยู่ติดกันในหน้ารายการบอร์ด มักใช้รูปภาพขนาด 1200x60 หรือขนาดอื่น ๆ รวมถึง Flash หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงตามจำนวนหมวดหมู่ที่มี<br />การวิเคราะห์ความคุ้มค่า: เนื่องจากปรากฏในตำแหน่งที่สังเกตได้ง่ายในหน้ารายการบอร์ด ผลลัพธ์การแสดงโฆษณาจึงค่อนข้างดี แต่การมีโฆษณามากหรือขนาดใหญ่เกินไปอาจสร้างความรำคาญให้กับผู้เข้าชมได้',
	'intercat_fids' => 'โซนที่ลงโฆษณา',
	'intercat_fids_comment' => 'ตั้งค่าโซนของบอร์ดที่จะลงโฆษณา',
	'intercat_position' => 'ตำแหน่งโฆษณา',
	'intercat_position_comment' => 'ตั้งค่าว่าจะให้โฆษณาแสดงอยู่ใต้โซนใด',
	'intercat_position_random' => 'สุ่มทุกตำแหน่ง',
	'intercat_position_fav' => 'แถบรายการโปรด',
	];

