<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'threadlist_name' => 'โฆษณาแทรกรายการกระทู้ บอร์ด/วงใน',
	'threadlist_desc' => 'รูปแบบการแสดงผล: โฆษณาจะแสดงแทรกอยู่ในตำแหน่งของรายการกระทู้ในหน้าแรกของรายการกระทู้ โดยสามารถจำลองเป็นที่อยู่กระทู้ที่มีเนื้อหาโฆษณาเพื่อดึงดูดความสนใจของผู้เข้าชม',
	'threadlist_fids' => 'บอร์ดที่ลงโฆษณา',
	'threadlist_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'threadlist_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'threadlist_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'threadlist_pos' => 'ตำแหน่งโฆษณา',
	'threadlist_pos_comment' => 'ตั้งค่าลำดับที่ต้องการให้โฆษณาแสดงในรายการกระทู้ หากไม่ระบุระบบจะสุ่มตำแหน่งการแสดงผล',
	'threadlist_mode' => 'โหมดการแสดงผล',
	'threadlist_mode_comment' => 'โหมดอิสระ: โฆษณาจะใช้พื้นที่ความกว้างทั้งหมดของรายการกระทู้<br />โหมดกระทู้: จำลองโฆษณาให้เหมือนกับหนึ่งกระทู้ เมื่อคลิกแล้วจะลิงก์ไปยังกระทู้ที่กำหนดไว้',
	'threadlist_mode_0' => 'โหมดอิสระ',
	'threadlist_mode_1' => 'โหมดกระทู้',
	'threadlist_tid' => 'ไอดีกระทู้ (tid) สำหรับโหมดกระทู้',
	'threadlist_threadurl' => 'URL กระทู้ที่กำหนดเองสำหรับโหมดกระทู้',
	'threadlist_threadurl_comment' => 'เว้นว่างไว้หากต้องการใช้ URL ของกระทู้ที่ระบุไว้โดยตรง',
	];

