<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'float_name' => 'โฆษณาลอยทั่วไป',
	'float_desc' => 'รูปแบบการแสดงผล: โฆษณาจะแสดงที่มุมซ้ายล่างของหน้าเว็บ เมื่อมีการเลื่อนหน้าจอ โฆษณาจะเคลื่อนที่ตามเพื่อรักษาตำแหน่งเดิมไว้ มักใช้รูปภาพขนาดเล็กหรือ Flash หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงเพียงหนึ่งรายการ<br />การวิเคราะห์ความคุ้มค่า: โฆษณาลอยเป็นเครื่องมือที่มีประสิทธิภาพในการโปรโมทเชิงพาณิชย์ เนื่องจากความสามารถในการเคลื่อนไหวตามการเลื่อนหน้าจอ ทำให้ดึงดูดสายตาได้มากกว่ารูปภาพหรือข้อความที่อยู่กับที่ แต่ในทางกลับกัน ความโดดเด่นนี้อาจสร้างความรำคาญให้กับผู้เข้าชมที่ไม่สนใจเนื้อหาโฆษณาได้ โปรดระวังอย่าใช้รูปภาพหรือ Flash ที่มีขนาดใหญ่เกินไปเพื่อไม่ให้กระทบต่อการอ่านเนื้อหาในหน้าเว็บ',
	'float_index' => 'หน้าแรก',
	'float_fids' => 'บอร์ดที่ลงโฆษณา',
	'float_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'float_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'float_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'float_position' => 'ตำแหน่งที่ลอย',
	'float_position_comment' => 'ตั้งค่าตำแหน่งที่โฆษณาจะลอยแสดงผล',
	'float_position_left' => 'ด้านซ้าย',
	'float_position_right' => 'ด้านขวา',
	'float_category' => 'หมวดหมู่พอร์ทัลที่ลงโฆษณา',
	'float_category_comment' => 'ตั้งค่าหมวดหมู่บทความที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "พอร์ทัล" ไว้ด้วย',
	'float_disableclose' => 'ลิงก์ปิดโฆษณา',
	'float_disableclose_comment' => 'หากในโค้ดโฆษณาได้ฝังปุ่มปิดไว้แล้ว คุณสามารถปิดลิงก์สำหรับปิดที่ระบบเตรียมไว้ให้ได้',
	'float_show' => 'แสดง',
	'float_hidden' => 'ซ่อน',
	];

