<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'text_name' => 'โฆษณาช่องตาราง พอร์ทัล/บอร์ด/วงใน/สเปซ',
	'text_desc' => 'รูปแบบการแสดงผล: โฆษณาข้อความในหน้าเว็บจะแสดงเป็นรูปแบบตาราง อยู่ที่ส่วนกลางตอนบนของหน้าเว็บบอร์ดหรือวงใน มักใช้รูปแบบข้อความ แต่อาจใช้รูปภาพขนาดเล็กหรือ Flash ได้เช่นกัน หากมีโฆษณาข้อความหลายรายการ ระบบจะแสดงทั้งหมดในรูปแบบตารางตามลำดับที่ตั้งไว้ และจะจัดเรียงจำนวนคอลัมน์ให้อยู่ระหว่าง 3 ถึง 5 คอลัมน์โดยอัตโนมัติเพื่อให้ได้ผลลัพธ์ที่ดีที่สุด<br />การวิเคราะห์ความคุ้มค่า: แม้โฆษณาประเภทนี้จะเน้นข้อความเป็นหลัก แต่ด้วยตำแหน่งที่อยู่ส่วนบนของหน้าเว็บ ทำให้เป็นเนื้อหาที่ผู้เข้าชมต้องผ่านตาเสมอ การที่หน้าเว็บเดียวสามารถแสดงโฆษณาได้มากกว่าสิบรายการ ทำให้เป็นวิธีการโปรโมทที่เข้าถึงง่ายและคุ้มค่า นอกจากนี้ยังสามารถใช้สำหรับงานประชาสัมพันธ์หรือประกาศของเว็บบอร์ดเองได้อีกด้วย',
	'text_index' => 'หน้าแรก',
	'text_fids' => 'บอร์ดที่ลงโฆษณา',
	'text_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'text_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'text_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'text_category' => 'หมวดหมู่บทความที่ลงโฆษณา',
	'text_category_comment' => 'ตั้งค่าหมวดหมู่บทความที่จะลงโฆษณา',
	];

