<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'headerbanner_name' => 'โฆษณาแถบยาวส่วนหัวทั่วไป',
	'headerbanner_desc' => 'รูปแบบการแสดงผล: แสดงที่ด้านบนของหน้าเว็บ มักใช้รูปภาพขนาด 1200x60 หรือ Flash หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงเพียงหนึ่งรายการ<br />การวิเคราะห์ความคุ้มค่า: เนื่องจากสามารถแสดงเนื้อหาโฆษณาในตำแหน่งที่โดดเด่นที่สุดทันทีที่เปิดหน้าเว็บ จึงเป็นหนึ่งในประเภทโฆษณาที่มีราคาสูงที่สุด และเหมาะที่สุดสำหรับการประชาสัมพันธ์เชิงพาณิชย์หรือการส่งเสริมภาพลักษณ์แบรนด์',
	'headerbanner_index' => 'หน้าแรก',
	'headerbanner_fids' => 'บอร์ดที่ลงโฆษณา',
	'headerbanner_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "เว็บบอร์ด" ไว้ด้วย',
	'headerbanner_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'headerbanner_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'headerbanner_category' => 'หมวดหมู่พอร์ทัลที่ลงโฆษณา',
	'headerbanner_category_comment' => 'ตั้งค่าหมวดหมู่บทความที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "พอร์ทัล" ไว้ด้วย',
	];

