<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[
	'couplebanner_name' => 'โฆษณาขนาบข้างทั่วไป',
	'couplebanner_desc' => 'รูปแบบการแสดงผล: โฆษณาขนาบข้างจะแสดงเป็นรูปภาพทรงสี่เหลี่ยมผืนผ้าที่ด้านซ้ายและขวาของส่วนบนของหน้าเว็บ มักใช้รูปภาพแนวตั้งหรือ Flash โฆษณาประเภทนี้ควรใช้เมื่อมีการกำหนดความกว้างของตารางหลักเป็นพิกเซลเท่านั้น หากใช้ความกว้างเกิน 90% ของหน้าจออาจส่งผลกระทบต่อการเข้าชมตามปกติ เมื่อเบราว์เซอร์มีความกว้างน้อยกว่า 800 พิกเซล ระบบจะซ่อนโฆษณานี้โดยอัตโนมัติ หากมีโฆษณาตำแหน่งนี้หลายรายการ ระบบจะสุ่มเลือกมาแสดงเพียงหนึ่งรายการ<br />การวิเคราะห์ความคุ้มค่า: เนื่องจากแสดงเฉพาะที่ด้านข้างของหน้าจอความละเอียดสูง (1024x768 ขึ้นไป) และใช้พื้นที่ว่างของหน้าเว็บ จึงไม่ทำให้ผู้เข้าชมรู้สึกรำคาญและสามารถเน้นเนื้อหาที่โปรโมทได้ดี แต่เนื่องจากข้อกำหนดด้านความละเอียดและความกว้างตารางหลัก ทำให้การเข้าถึงกลุ่มเป้าหมายอาจไม่ครอบคลุม 100%',
	'couplebanner_index' => 'หน้าแรก',
	'couplebanner_fids' => 'บอร์ดที่ลงโฆษณา',
	'couplebanner_fids_comment' => 'ตั้งค่าบอร์ดที่จะลงโฆษณา',
	'couplebanner_groups' => 'หมวดหมู่วงในที่ลงโฆษณา',
	'couplebanner_groups_comment' => 'ตั้งค่าหมวดหมู่วงในที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "วงใน" ไว้ด้วย',
	'couplebanner_position' => 'ตำแหน่งโฆษณา',
	'couplebanner_position_comment' => 'ตั้งค่าตำแหน่งของโฆษณาขนาบข้าง',
	'couplebanner_position_left' => 'ด้านซ้าย',
	'couplebanner_position_right' => 'ด้านขวา',
	'couplebanner_coupleadid' => 'โฆษณาคู่ขนาน',
	'couplebanner_coupleadid_comment' => 'ตั้งค่าโฆษณาที่จะนำมาจับคู่แสดงผลร่วมกับโฆษณาปัจจุบัน (ซ้าย/ขวา)',
	'couplebanner_category' => 'หมวดหมู่พอร์ทัลที่ลงโฆษณา',
	'couplebanner_category_comment' => 'ตั้งค่าหมวดหมู่บทความที่จะลงโฆษณา จะมีผลเมื่อขอบเขตการลงโฆษณารวม "พอร์ทัล" ไว้ด้วย',
	'couplebanner_disableclose' => 'ลิงก์ปิดโฆษณา',
	'couplebanner_disableclose_comment' => 'หากในโค้ดโฆษณาได้ฝังปุ่มปิดไว้แล้ว คุณสามารถปิดลิงก์สำหรับปิดที่ระบบเตรียมไว้ให้ได้',
	'couplebanner_show' => 'แสดง',
	'couplebanner_hidden' => 'ซ่อน',
	];

