<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang =
	[

	'EDT' => 'แก้ไข',

	'DEL' => 'ลบ',
	'DLP' => 'ลบการตอบกลับ',
	'DCM' => 'ลบเรตติ้งความคิดเห็น',
	'PRN' => 'ลบโพสต์จำนวนมาก',
	'UDL' => 'ยกเลิกการลบ',

	'DIG' => 'ตั้งเป็นกระทู้สำคัญ',
	'UDG' => 'ยกเลิกกระทู้สำคัญ',
	'EDI' => 'ตั้งเป็นกระทู้สำคัญแบบกำหนดเวลา',
	'UED' => 'ยกเลิกกระทู้สำคัญแบบกำหนดเวลา',

	'CLS' => 'ปิด',
	'OPN' => 'เปิด',
	'ECL' => 'ปิดแบบกำหนดเวลา',
	'UEC' => 'ยกเลิกการปิดแบบกำหนดเวลา',
	'EOP' => 'เปิดแบบกำหนดเวลา',
	'UEO' => 'ยกเลิกการเปิดแบบกำหนดเวลา',

	'STK' => 'ปักหมุด',
	'UST' => 'ยกเลิกการปักหมุด',
	'EST' => 'ปักหมุดแบบกำหนดเวลา',
	'UES' => 'ยกเลิกการปักหมุดแบบกำหนดเวลา',

	'SPL' => 'แยกกระทู้',
	'MRG' => 'รวมกระทู้',

	'HLT' => 'ตั้งค่าไฮไลต์',
	'UHL' => 'ยกเลิกไฮไลต์',
	'EHL' => 'ไฮไลต์แบบกำหนดเวลา',
	'UEH' => 'ยกเลิกไฮไลต์แบบกำหนดเวลา',

	'BMP' => 'ดันกระทู้',
	'DWN' => 'กดกระทู้ลง',

	'MOV' => 'ย้าย',
	'CPY' => 'คัดลอก',
	'TYP' => 'จัดหมวดหมู่',

	'RFD' => 'บังคับคืนเงิน',

	'MOD' => 'อนุมัติ',
	'MDS' => 'ปฏิเสธการอนุมัติ',

	'ABL' => 'เพิ่มเข้าคลังบทความ',
	'RBL' => 'ลบออกจากคลังบทความ',

	'PTS' => 'พุชกระทู้',
	'RFS' => 'ยกเลิกการพุช',
	'RMR' => 'ยกเลิกการแจกรางวัล',
	'BNP' => 'ซ่อนโพสต์',
	'UBN' => 'ยกเลิกการซ่อน',

	'REC' => 'แนะนำ',
	'URE' => 'ยกเลิกการแนะนำ',

	'WRN' => 'ตักเตือน',
	'UWN' => 'ยกเลิกคำเตือน',

	'SPA' => 'เพิ่มตราประทับ',
	'SPD' => 'ยกเลิกตราประทับ',

	'SLA' => 'เพิ่มไอคอน',
	'SLD' => 'ยกเลิกไอคอน',

	'REG' => 'แนะนำวงใน',

	'PTA' => 'สร้างเป็นบทความ',

	'MAG' => 'ไอเท็มเวทย์',

	'REB' => 'พุช',

	'LIV' => 'ถ่ายทอดสด',
	'LIC' => 'ยกเลิกการถ่ายทอดสด',

	];

