<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = [
	'主题评价',
	'帖子点评',
	'预置观点',
	'编辑帖子',
	'附件扩展名',
	'图片附件',
	'多媒体代码',
	'缩略图',
	'添加水印',
	'阅读权限',
	'隐身',
	'积分转账',
	'关注',
	'短消息',
	'HTML 代码',
	'全文搜索',
	'自定义头衔',
	'时间段限制',
	'验证问答',
	'安全提问',
	'登录方式',
	'最大字数',
	'淘专辑',
	'匿名',
	'阅读权限',
	'[hide]',
	'多媒体代码',
	'主题评价',
	'附件尺寸',
	'附件类型',
	'发起活动',
	'特殊主题',
	'购买邀请码',
	'分类信息',
	'开启图片列表',
	'显示边栏',
	'页面缓存系数',
	'淘帖',
	'推荐主题',
	'Discuz! 代码',
	'防采集',
	'推荐回复',
	'安全邮箱',
	'安全手机号',
	'积分兑换',
	'敏感信息加密',
	'编辑器',
];