<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: install_lang.php 36287 2016-12-12 03:59:05Z nemohou $
 */

if(!defined('IN_COMSENZ')) {
	exit('Access Denied');
}

define('UC_VERNAME', 'ภาษาไทย');
$lang = array(
	'SC_UTF8' => 'ภาษาไทย UTF-8', /*jaideejung007*/
	'TC_UTF8' => '繁体中文 UTF8 版',

	'title_install' => 'โปรแกรมติดตั้ง '.SOFT_NAME.'',
	'agreement_yes' => 'ยอมรับ',
	'agreement_no' => 'ปฏิเสธ',
	'notset' => 'ไม่จำกัด',
	'enable' => 'เปิด',
	'disable' => 'ปิด',

	'message_title' => 'คำชี้แจง',
	'error_message' => 'ข้อความผิดพลาด',
	'message_return' => 'คลิกที่นี่เพื่อย้อนกลับ',
	'return' => 'ย้อนกลับ',
	'install_wizard' => 'โปรแกรมติดตั้ง',
	'config_nonexistence' => 'ไฟล์กำหนดค่าไม่มี',
	'nodir' => 'ไม่มีโฟลเดอร์',
	'redirect' => 'เบราว์เซอร์จะไปยังหน้าต่อไปโดยอัตโนมัติ คุณไม่ต้องกระทำการใด ๆ<br>หากเบราว์เซอร์ของคุณไม่เปลี่ยนเส้นทางให้อัตโนมัติ กรุณาคลิกที่นี่',
	'auto_redirect' => 'เบราว์เซอร์จะข้ามไปยังหน้าต่อไปโดยอัตโนมัติ',
	'database_errno_1064' => 'เกิดข้อผิดพลาดทางไวยากรณ์ของ SQL',

	'dbpriv_createtable' => 'คุณไม่ได้รับสิทธิ์ในการ CREATE TABLE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_insert' => 'คุณไม่ได้รับสิทธิ์ในการ INSERT ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_select' => 'คุณไม่ได้รับสิทธิ์ในการ SELECT ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_update' => 'คุณไม่ได้รับสิทธิ์ในการ UPDATE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_delete' => 'คุณไม่ได้รับสิทธิ์ในการ DELETE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_droptable' => 'คุณไม่ได้รับสิทธิ์ในการ DROP TABLE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',

	'db_not_null' => 'ในระบบฐานข้อมูลมีการติดตั้ง UCenter แล้ว  หากคุณทำการติดตั้งต่อ ข้อมูลเดิมจะถูกล้างออก',
	'db_drop_table_confirm' => 'การติดตั้งต่อจะลบข้อมูลเดิมทั้งหมด คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ',

	'writeable' => 'เขียนได้',
	'unwriteable' => 'เขียนไม่ได้',
	'old_step' => 'ขั้นตอนก่อนหน้า',
	'new_step' => 'ขั้นตอนถัดไป',

	'database_errno_2003' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล กรุณาตรวจสอบฐานข้อมูลว่าเชื่อมต่ออยู่เซิร์ฟเวอร์ฐานข้อมูลถูกต้องหรือไม่',
	'database_errno_1044' => 'ไม่สามารถสร้างฐานข้อมูลใหม่ กรุณาตรวจสอบชื่อฐานข้อมูลที่กรอกให้ถูกต้อง',
	'database_errno_1045' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล กรุณาตรวจสอบชื่อผู้ใช้ฐานข้อมูลและรหัสผ่านให้ถูกต้อง',
	'database_connect_error' => 'การเชื่อมต่อฐานข้อมูลผิดพลาด',
	'run_sql_error' => 'Discuz! Database Error',

	'step_title_1' => 'ตรวจสอบก่อนติดตั้ง',
	'step_title_2' => 'กำหนดข้อมูลระบบ',
	'step_title_3' => 'สร้างฐานข้อมูล',
	'step_title_4' => 'ติดตั้ง',
	'step_env_check_title' => 'เริ่มต้นการติดตั้ง',
	'step_env_check_desc' => 'ตรวจสอบระบบการเข้าถึงของไฟล์และโฟลเดอร์',
	'step_db_init_title' => 'ติดตั้งฐานข้อมูล',
	'step_db_init_desc' => 'ดำเนินการติดตั้งฐานข้อมูลและสร้างบัญชีผู้ดูแลระบบ',

	'step1_file' => 'โฟลเดอร์และไฟล์',
	'step1_need_status' => 'สถานะที่ต้องการ',
	'step1_status' => 'สถานะปัจจุบัน',
	'not_continue' => 'กรุณาตรวจสอบโฟลเดอร์/ไฟล์ สีแดงและลองอีกครั้ง',

	'tips_dbinfo' => 'กรอกข้อมูลระบบฐานข้อมูล',
	'tips_dbinfo_comment' => '',
	'tips_admininfo' => 'กรอกข้อมูลผู้ดูแลระบบ',
	'step_ext_info_title' => 'การติดตั้งสำเร็จ',
	'step_ext_info_comment' => 'คลิกที่นี่เพื่อเข้าสู่ระบบ',

	'ext_info_succ' => 'ติดตั้งเรียบร้อยแล้ว',
	'install_submit' => 'ตกลง',
	'install_locked' => 'การติดตั้งถูกล็อกแล้ว เนื่องจากได้มีการติดตั้งแล้วก่อนหน้านี้ หากคุณต้องการติดตั้งใหม่ กรุณาลบไฟล์ที่มีอยู่บนเซิร์ฟเวอร์ก่อน<br /> '.str_replace(ROOT_PATH, '', $lockfile),
	'error_stuck_msg' => 'การติดตั้งไม่มีความคืบหน้าเป็นเวลานานแล้ว อาจเกิดข้อผิดพลาดเนื่องจากการขอข้อมูลที่เกี่ยวข้องหมดเวลาหรือเซิร์ฟเวอร์มีข้อผิดพลาดอย่างรุนแรงทำให้การทำงานถูกยกเลิก',
	'error_quit_msg' => 'คุณต้องแก้ปัญหาข้างต้นก่อน ไม่เช่นนั้นการติดตั้งจะไม่สามารถดำเนินการต่อไปได้',
	'error_reinstall_msg' => 'คุณอาจจะพบปัญหาด้านประสิทธิภาพฐานข้อมูล InnoDB ของคุณ กรุณาปรับค่าหมดเวลาเชื่อมต่อ (timeout) ใน PHP ให้สูงขึ้น และลองรีเฟรชหน้าเว็บ เพื่อลองติดตั้งใหม่อีกครั้ง',

	'step_app_reg_title' => 'ตั้งค่าระบบ',
	'step_app_reg_desc' => 'ทดสอบระบบเซิร์ฟเวอร์และตั้งค่า UCenter',
	'tips_ucenter' => 'กรุณากรอกข้อมูลของ UCenter ที่กำหนดไว้',
	'tips_ucenter_comment' => 'UCenter เป็นผลิตภัณฑ์หลักของบริษัทฯ Comsenz ซึ่ง Discuz! Board ต้องติดตั้งและพึ่งพาการทำงานของโปรแกรมนี้ หากคุณติดตั้ง UCenter ไว้แล้ว กรุณากรอกข้อมูลด้านล่าง หากคุณยังไม่มีและยังไม่ได้ติดตั้ง UCenter กรุณาไปที่ <a href="https://www.discuzthai.com/" target="blank">DiscuzThai</a> เพื่อดาวน์โหลด UCenter เวอร์ชันภาษาไทย แล้วทำการติดตั้งเพื่อดำเนินการต่อไป',

	'advice_mysqli_connect' => 'กรุณาตรวจสอบว่าโมดูล mysqli มีการโหลดอย่างถูกต้องแล้ว',
	'advice_xml_parser_create' => 'ฟังก์ชันนี้ต้องใช้ PHP เพื่อรองรับ XML กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_json_encode' => 'ฟังก์ชันนี้ต้องใช้ PHP เพื่อรองรับ JSON กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_dns_get_record' => 'ฟังก์ชั่นนี้ต้องการการสนับสนุน DNS จาก PHP ซึ่งเป็นค่าเริ่มต้นที่มาพร้อมกับ PHP หากพบข้อผิดพลาด เช่น การคอมไพล์และติดตั้งที่ไม่ถูกต้อง หรือขาดคอมโพเนนต์ที่จำเป็น อาจส่งผลให้เกิดปัญหานี้ กรุณาติดต่อผู้ให้บริการเพื่อยืนยันว่าคุณได้เปิดใช้งานฟังก์ชั่นนี้แล้ว',
	'advice_fsockopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_pfsockopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_stream_socket_client' => 'ฟังก์ชันนี้ต้องการตัวเลือก stream_socket_client ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_curl_init' => 'ฟังก์ชันนี้ต้องการตัวเลือก curl_init ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',

	'ucurl' => 'ที่อยู่ URL ของ UCenter',
	'ucpw' => 'รหัสผ่านของ UCenter',
	'ucip' => 'ที่อยู่ IP ของ UCenter',
	'ucenter_ucip_invalid' => 'รูปแบบผิดพลาด กรุณากรอกที่อยู่ IP ให้ถูกต้อง',
	'ucip_comment' => 'ที่อยู่ IP ไม่จำเป็นต้องกรอก',

	'tips_siteinfo' => 'กรุณากรอกข้อมูลเว็บไซต์',
	'sitename' => 'ชื่อเว็บไซต์',
	'siteurl' => 'URL เว็บไซต์',

	'forceinstall' => 'กำลังติดตั้ง',
	'dbinfo_forceinstall_invalid' => 'ในฐานข้อมูลปัจจุบันมีตารางที่มีคำนำหน้าชื่อเดียวกันกับตารางที่ต้องการติดตั้ง คุณสามารถเปลี่ยน "คำนำหน้าชื่อตาราง" เพื่อหลีกเลี่ยงการลบข้อมูลเก่า หรือหากต้องการคุณสามารถเลือก "ติดตั้งแบบบังคับ" ซึ่งจะลบข้อมูลเก่าและไม่สามารถกู้คืนได้',
	'dbinfo_myisam2innodb_invalid' => 'หากคุณพบปัญหาจากประสิทธิภาพการทำงานของ InnoDB และการติดตั้งล้มเหลวเนื่องจากหมดเวลาการเชื่อมต่อ คุณสามารถลองใช้วิธีนี้เพื่อทำการติดตั้งให้สำเร็จได้',

	'click_to_back' => 'คลิกกลับไปที่ขั้นตอนที่แล้ว',
	'adminemail' => 'อีเมลผู้ดูแล',
	'adminemail_comment' => 'ใช้ในการส่งรายงานข้อผิดพลาด',
	'dbhost_comment' => 'โดยทั่วไปจะเป็น 127.0.0.1 หรือ localhost',
	'dbname_comment' => 'ชื่อฐานข้อมูลใช้สำหรับติดตั้ง Discuz!',
	'dbuser_comment' => 'ชื่อผู้ใช้ฐานข้อมูลของคุณ',
	'dbpw_comment' => 'รหัสผ่านฐานข้อมูลของคุณ',
	'tablepre_comment' => 'ถ้าติดตั้งในฐานข้อมูลเดียวกันกรุณาแก้ไขคำนำหน้าตารางใหม่',
	'forceinstall_check_label' => 'ฉันต้องการลบข้อมูลที่ติดตั้งไว้ก่อนหน้านี้!!!',
	'myisam2innodb_check_label' => 'ติดตั้งโดยใช้วิธี MyISAM แล้วทำการแปลงเป็น InnoDB ต่อ',
	'initdbresult_succ' => 'ติดตั้งฐานข้อมูลเสร็จสมบูรณ์',
	'initdbdataresult_succ' => 'เริ่มต้นการเตรียมข้อมูลสำหรับติดตั้งฐานข้อมูลเรียบร้อยแล้ว',
	'initdbinnodbresult_succ' => 'การแปลงตารางข้อมูล InnoDB เสร็จสิ้นแล้ว',
	'initsys' => 'กำลังเริ่มต้นการติดตั้งระบบ',

	'uc_url_empty' => 'คุณไม่ได้กรอก URL ของ UCenter กรุณากลับไปกรอก',
	'uc_url_invalid' => 'รูปแบบของ URL ผิดพลาด',
	'uc_url_unreachable' => 'ที่อยู่ URL ของ UCenter อาจกรอกไม่ถูกต้อง และสาเหตุที่เป็นไปได้มีดังนี้:<br />1. เส้นทาง UCenter ไม่ถูกต้องหรือมีสถานะผิดปกติ<br />2. ปัญหาที่ไม่สามารถเรียกใช้การสอบถามสถานะ UCenter หรือถูกบล็อก<br />3. การตั้งค่าในระบบหลังบ้านของ UCenter ในส่วนของ "การเพิ่มฟังก์ชั่นของโปรแกรมผ่าน URL" ยังไม่ได้เปิดใช้งาน',
	'uc_ip_invalid' => 'ไม่สามารถแปลงชื่อโดเมนเป็นที่อยู่ IP ของเซิร์ฟเวอร์เว็บไซต์ได้ กรุณากรอก IP ของเว็บไซต์แทน',
	'uc_admin_invalid' => 'การยืนยันรหัสผ่านผู้ก่อตั้ง UCenter ไม่สำเร็จ สาเหตุที่เป็นไปได้คือ:<br />1. รหัสผ่านผู้ก่อตั้ง UCenter ไม่ถูกต้อง<br />2. ชื่อผู้ใช้ของผู้ก่อตั้งและที่อยู่ IP ถูกล็อก เนื่องจากกรอกรหัสผ่านผิดซ้ำหลายครั้ง<br />3. การตั้งค่าในระบบหลังบ้านของ UCenter ในส่วนของ "การเพิ่มฟังก์ชั่นของโปรแกรมผ่าน URL" ยังไม่ได้เปิดใช้งาน',
	'uc_data_invalid' => 'การเชื่อมต่อล้มเหลว กรุณาตรวจสอบที่อยู่ URL ของ UCenter ให้ถูกต้อง',
	'uc_dbcharset_incorrect' => 'ชุดอักขระฐานข้อมูล UCenter ไม่สอดคล้องกับชุดอักขระของโปรแกรมปัจจุบัน',
	'uc_api_add_app_error' => 'เพิ่มโปรแกรมไปยัง UCenter ผิดพลาด',
	'uc_dns_error' => 'DNS ของ UCenter เกิดข้อผิดพลาด กรุณากลับไปกรอกที่อยู่ IP ของ UCenter',

	'ucenter_ucurl_invalid' => 'URL ของ UCenter ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'ucenter_ucpw_invalid' => 'รหัสผ่านของ UCenter ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'siteinfo_siteurl_invalid' => 'URL ของเว็บไซต์ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'siteinfo_sitename_invalid' => 'ชื่อเว็บไซต์ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbhost_invalid' => 'เซิร์ฟเวอร์ฐานข้อมูลว่างหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbuser_invalid' => 'ชื่อผู้ใช้ฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbpw_invalid' => 'รหัสผ่านฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_adminemail_invalid' => 'อีเมลผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_username_invalid' => 'ชื่อผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_email_invalid' => 'อีเมลผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_password_invalid' => 'รหัสผ่านผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_password2_invalid' => 'ยืนยันรหัสผ่านผู้ดูแลระบบว่างเปล่าหรือไม่ตรงกัน กรุณากลับไปตรวจสอบ',

	'install_dzstandalone' => '<div class="selradio"><input type="radio" id="install_ucenter_standalone" name="install_ucenter" value="standalone" onclick="if(this.checked)$(\'form_items_2\').style.display=\'none\';" /><label for="install_ucenter_standalone">ติดตั้ง Discuz! X ใหม่ (โหมดสแตนด์อโลน)</label></div>',
	'install_dzfull' => '<div class="selradio"><input type="radio" id="install_ucenter_yes"'.(getgpc('install_ucenter') != 'no' ? ' checked="checked"' : '').' name="install_ucenter" value="yes" onclick="if(this.checked)$(\'form_items_2\').style.display=\'none\';" /><label for="install_ucenter_yes">ติดตั้ง Discuz! X และ UCenter Server ใหม่</label></div>',
	'install_dzonly' => '<div class="selradio"><input type="radio" id="install_ucenter_no"'.(getgpc('install_ucenter') == 'no' ? ' checked="checked"' : '').' name="install_ucenter" value="no" onclick="if(this.checked)$(\'form_items_2\').style.display=\'\';" /><label for="install_ucenter_no">ติดตั้งเฉพาะ Discuz! X (เชื่อมต่อกับ UCenter Server ที่เคยติดตั้งไว้แล้ว)</label></div>',

	'username' => 'ชื่อผู้ดูแลระบบ',
	'email' => 'อีเมล',
	'password' => 'รหัสผ่าน',
	'password_comment' => 'รหัสผ่านผู้ดูแลระบบไม่สามารถเว้นว่างได้',
	'password2' => 'ยืนยันรหัสผ่าน',

	'admininfo_invalid' => 'ข้อมูลของผู้ดูแลระบบไม่สมบูรณ์ กรุณาตรวจสอบชื่อผู้ดูแลระบบ รหัสผ่าน และที่อยู่อีเมลของผู้ดูแลระบบให้ถูกต้องและครบถ้วน',
	'dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่ากรุณากรอกชื่อฐานข้อมูล',
	'tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือรูปแบบไม่ถูกต้องกรุณาตรวจสอบ',
	'admin_username_invalid' => 'ชื่อผู้ดูแลระบบไม่ถูกต้อง ไม่ควรเกิน 15 ตัวอักษรภาษาอังกฤษ และไม่ควรมีอักขระพิเศษ เช่น ภาษาจีน ตัวอักษร หรือตัวเลขเท่านั้นที่สามารถใช้งานได้',
	'admin_password_invalid' => 'รหัสผ่านไม่ตรงกันกับที่กรอกไว้ด้านบน กรุณากรอกรหัสผ่านใหม่อีกครั้ง',
	'admin_email_invalid' => 'ข้อผิดพลาด ที่อยู่อีเมลนี้ใช้ไปแล้วหรือรูปแบบอีเมลที่ไม่ถูกต้อง กรุณาใช้อีเมลอื่น',
	'admin_invalid' => 'ข้อมูลผู้ดูแลระบบของคุณยังไม่ครบถ้วน กรุณากรอกข้อมูลในทุก ๆ ช่องให้ครบถ้วน',
	'admin_exist_password_error' => 'ผู้ใช้งานนี้มีอยู่แล้วในระบบ หากคุณต้องการตั้งผู้ใช้งานนี้เป็นผู้ดูแลระบบของเว็บบอร์ด กรุณากรอกรหัสผ่านของผู้ใช้งานนี้ให้ถูกต้อง หรือคุณจะเปลี่ยนชื่อผู้ดูแลระบบของเว็บบอร์ดนี้ใหม่ก็ได้เช่นเดียวกัน',

	'tagtemplates_subject' => 'ชื่อ',
	'tagtemplates_uid' => 'ID ผู้ใช้',
	'tagtemplates_username' => 'โพสต์โดย',
	'tagtemplates_dateline' => 'วันที่',
	'tagtemplates_url' => 'ที่อยู่หัวเรื่อง',

	'uc_version_incorrect' => 'เวอร์ชันเซิร์ฟเวอร์ UCenter ของคุณต่ำเกินไป กรุณาอัปเกรดเซิร์ฟเวอร์ UCenter เป็นเวอร์ชันล่าสุดก่อน สามารถดาวน์โหลดได้ที่: http://discuzthai.com/',
	'config_unwriteable' => 'ตัวช่วยการติดตั้งไม่สามารถเขียนไฟล์ config.inc.php ให้กำหนดสิทธิ์ไฟล์นี้เป็น (777)',

	'install_in_processed' => 'กำลังติดตั้ง...',
	'install_succeed' => 'ติดตั้งเสร็จสมบูรณ์ คลิกที่นี่เพื่อไปยังเว็บไซต์ของคุณ',

	'init_credits_karma' => 'พลังน้ำใจ',
	'init_credits_money' => 'เงิน',

	'init_postno0' => 'เจ้าของโพสต์',
	'init_postno1' => 'เมนต์แรก',
	'init_postno2' => 'เมนต์สอง',
	'init_postno3' => 'เมนต์สาม',

	'init_support' => 'สนับสนุน',
	'init_opposition' => 'คัดค้าน',

	'init_group_0' => 'สมาชิก',
	'init_group_1' => 'ผู้ดูแลระบบ',
	'init_group_2' => 'ผู้ช่วยผู้ดูแลระบบ',
	'init_group_3' => 'ผู้ดูแลบอร์ด',
	'init_group_4' => 'แบนห้ามโพสต์',
	'init_group_5' => 'แบนห้ามเข้า',
	'init_group_6' => 'แบน IP',
	'init_group_7' => 'ผู้เยี่ยมชม',
	'init_group_8' => 'รอยืนยัน',
	'init_group_9' => 'Daemon',
	'init_group_10' => 'Newbie',
	'init_group_11' => 'Member',
	'init_group_12' => 'Full Member',
	'init_group_13' => 'Senior Member',
	'init_group_14' => 'Gold Member',
	'init_group_15' => 'Veteran',

	'init_rank_1' => 'ผู้เริ่มต้น',
	'init_rank_2' => 'โพสต์มือใหม่',
	'init_rank_3' => 'โพสต์มือสมัครเล่น',
	'init_rank_4' => 'โพสต์มืออาชีพ',
	'init_rank_5' => 'โพสต์มือฉมัง',

	'init_cron_1' => 'เคลียร์จำนวนโพสต์ในวันนี้',
	'init_cron_2' => 'อัปเดตยกยอดเวลาออนไลน์',
	'init_cron_3' => 'เคลียร์ข้อมูลประจำวัน',
	'init_cron_4' => 'สถิติ และอีเมลอวยพรวันคล้ายวันเกิด',
	'init_cron_5' => 'กู้คืนข้อความ',
	'init_cron_6' => 'เคลียร์ประกาศ',
	'init_cron_7' => 'อัปเดตหัวข้อที่หมดอายุ',
	'init_cron_8' => 'เคลียร์ข้อมูลการโปรโมทเว็บ',
	'init_cron_9' => 'เคลียร์กระทู้ประจำเดือน',
	'init_cron_10' => 'X-Space อัปเดตสมาชิกวันนี้',
	'init_cron_11' => 'อัปเดตหัวข้อสัปดาห์นี้',

	'init_bbcode_1' => 'เนื้อหาจะเลื่อนในแนวนอน ผลลัพท์จะคล้ายกับ HTML marquee หมายเหตุ: ผลลัพท์นี้มีผลแสดงบน Internet Explorer เท่านั้น',
	'init_bbcode_2' => 'ใส่ Flash แอนนิเมชั่น',
	'init_bbcode_3' => 'แสดงสถานะ QQ ออนไลน์ คลิกที่ไอคอนของเขา(เธอ) เพื่อสนทนา',
	'init_bbcode_4' => 'ตัวยก',
	'init_bbcode_5' => 'ตัวห้อย',
	'init_bbcode_6' => 'ใส่เสียง Windows media',
	'init_bbcode_7' => 'ใส่เสียงหรือวีดีโอ Windows media',

	'init_qihoo_searchboxtxt' =>'ใส่คำที่ต้องการค้นหา สำหรับค้นหาอย่างรวดเร็วในเว็บไซต์นี้',
	'init_threadsticky' =>'ปักหมุด เห็นทุกเว็บบอร์ด,ปักหมุด เห็นเฉพาะหมวดหมู่นี้,ปักหมุด เห็นเฉพาะห้องนี้',

	'init_default_style' => 'สไตล์เริ่มต้น',
	'init_default_forum' => 'เว็บบอร์ดตัวอย่าง',
	'init_default_template' => 'ชุดเทมเพลตเริ่มต้น',
	'init_default_template_copyright' => 'Discuz!',

	'init_dataformat' => 'Y-n-j',
	'init_modreasons' => 'โพสต์โฆษณา\r\nสแปมโพสต์\r\nโพสต์ไม่เข้ากับเนื้อหา\r\nโพสต์ผิดห้อง\r\n\r\nถูกใจ\r\nรักเลย\r\nฮ่าๆ\r\nว้าว\r\nเศร้า\r\nโกรธ',
	'init_userreasons' => 'ถูกใจ\r\nรักเลย\r\nห่วงใย\r\nฮ่าๆ\r\nว้าว\r\nเศร้า\r\nโกรธ',
	'init_link' => 'เว็บไซต์ Discuz! อย่างเป็นทางการ',
	'init_link_note' => 'นำเสนอข่าวสารเกี่ยวกับผลิตภัณฑ์ Discuz! รวมไปถึงการดาวน์โหลดซอฟต์แวร์และการแลกเปลี่ยนข้อมูลเทคโนโลยีใหม่ล่าสุด',

	'init_promotion_task' => 'กิจกรรมโปรโมทเว็บไซต์',
	'init_gift_task' => 'กิจกรรมกล่องของขวัญ',
	'init_avatar_task' => 'กิจกรรมเปลี่ยนรูปโปรไฟล์',

	'copyright' => '&copy; 2001-'.date('Y').' <a href="https://code.dismall.com/" target="_blank">Discuz! Team</a>.',

	'license' => '
<div class="license"><h1>สัญญาอนุญาตให้ใช้สิทธิฉบับแปลภาษาไทย มีผลบังคับใช้กับผู้ใช้ชาวจีน</h1>
<p>ลิขสิทธิ์ (c) 2001-'.date('Y').' บริษัท เทนเซ็นต์ คลาวด์ คอมพิวติ้ง (ปักกิ่ง) จำกัด สงวนลิขสิทธิ์ทุกประการ</p>

<p>ขอบคุณที่เลือกใช้ผลิตภัณฑ์จาก เทนเซ็นต์ คลาวด์ หวังว่าความพยายามของเราจะสามารถให้บริการโซลูชันเว็บไซต์ที่มีประสิทธิภาพสูง รวดเร็ว และแข็งแกร่ง รวมถึงโซลูชันสำหรับชุมชนและเว็บบอร์ดที่มีประสิทธิภาพเช่นกัน เว็บไซต์ของชุมชนสำหรับใช้พูดคุยเกี่ยวกับผลิตภัณฑ์อย่างเป็นทางการคือ https://www.dismall.com เว็บไซต์ศูนย์แอปพลิเคชันผลิตภัณฑ์อย่างเป็นทางการ คือ: https://addon.dismall.com โค้ดโอเพ่นซอร์สสามารถดูได้ที่ https://code.dismall.com</p>

<p>ศูนย์แอปพลิเคชันอย่างเป็นทางการที่รวมอยู่ในโครงการ Discuz! X ของผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ดำเนินการโดย บริษัท เน็ตเวิร์คเทคโนโลยีเหอเฟยเอ้อร์เต๋า จำกัด โครงการโอเพ่นซอร์ส Discuz! X ได้รับการดูแลโดย บริษัท เน็ตเวิร์คเทคโนโลยีเหอเฟยเอ้อร์เต๋า จำกัด โค้ดโอเพ่นซอร์ส Discuz! X ได้รับการดูแลร่วมกันโดยคณะกรรมการการจัดการโอเพ่นซอร์สของโครงการและนักพัฒนาชุมชน เทนเซ็นต์ คลาวด์ ให้บริการทั้งหมดยกเว้นบริการข้างต้น</p>

<p>ข้อปฏิบัติสำหรับผู้ใช้: เอกสารนี้เป็นข้อตกลงทางกฎหมายระหว่างคุณและบริษัท เทนเซ็นต์ คลาวด์ เกี่ยวกับการใช้ซอฟต์แวร์ผลิตภัณฑ์และบริการต่าง ๆ ที่บริษัท เทนเซ็นต์ คลาวด์ นำเสนอ เป็นคำสัญญาทางกฎหมายและให้ความผูกพันทางกฎหมายระหว่างทั้งสองฝ่าย ไม่ว่าคุณจะเป็นบุคคลหรือองค์กร มีวัตถุประสงค์เพื่อทำกำไรหรือไม่ก็ตาม จะใช้เพื่อวัตถุประสงค์ใด (รวมถึงการใช้เพื่อการเรียนรู้และการศึกษา) คุณต้องอ่านข้อตกลงนี้อย่างรอบคอบ รวมถึงข้อจำกัดความรับผิดชอบหรือข้อจำกัดสิทธิ์ของคุณที่รวมอยู่ กรุณาตรวจสอบและยอมรับหรือไม่ยอมรับข้อกำหนดและเงื่อนไขการให้บริการนี้ หากคุณไม่เห็นด้วยกับข้อตกลงและ/หรือการแก้ไขข้อตกลงเหล่านี้ที่ บริษัท เทนเซ็นต์ คลาวด์ อาจมีเมื่อใดก็ตาม คุณควรหยุดใช้งานหรือยกเลิกบริการผลิตภัณฑ์จากบริษัท เทนเซ็นต์ คลาวด์ ในกรณีอื่น ๆ การลงทะเบียน เข้าสู่ระบบ ดาวน์โหลด ดู หรือใช้งานในรูปแบบใด ๆ ภายในผลิตภัณฑ์จากบริษัท เทนเซ็นต์ คลาวด์ จะถือว่าคุณยอมรับข้อตกลงการให้บริการทั้งหมดแบบสมบูรณ์ รวมถึงการยอมรับการแก้ไขข้อตกลงการให้บริการที่บริษัท เทนเซ็นต์ คลาวด์ อาจดำเนินการเมื่อใดก็ตาม</p>
<p>เมื่อมีการเปลี่ยนแปลงในข้อตกลงการให้บริการนี้บริษัท เทนเซ็นต์ คลาวด์ จะประกาศข้อมูลการแก้ไขบนเว็บไซต์ ข้อตกลงการให้บริการที่ได้รับการแก้ไขจะมีผลในทันทีที่ถูกประกาศบนหน้าเว็บไซต์ในระบบการจัดการหลังบ้าน (AdminCP) คุณสามารถเข้าสู่ระบบเว็บไซต์ที่จัดเก็บโค้ดโอเพนซอร์สเพื่อดูข้อตกลงการให้บริการรุ่นล่าสุดได้เสมอ หากคุณเลือกยอมรับข้อตกลงนี้ จะถือว่าคุณตกลงยอมรับเงื่อนไขของข้อตกลงทั้งหมด หากคุณไม่เห็นด้วยกับข้อตกลงการให้บริการนี้ คุณจะไม่ได้รับสิทธิ์ในการใช้งานบริการนี้ หากคุณละเมิดข้อตกลงการให้บริการนี้บริษัท เทนเซ็นต์ คลาวด์ มีสิทธิ์ในการระงับหรือยุติสิทธิ์ในการใช้งานผลิตภัณฑ์จาก เทนเซ็นต์ คลาวด์และสงวนสิทธิ์ในการดำเนินการตามกฎหมายที่เกี่ยวข้อง</p>
<p>คุณสามารถเริ่มใช้ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ได้ก็ต่อเมื่อคุณเข้าใจ ยอมรับ และปฏิบัติตามข้อกำหนดทั้งหมดของข้อตกลงนี้เท่านั้น คุณสามารถทำข้อตกลงเป็นลายลักษณ์อักษรอื่นโดยตรงกับ เทนเซ็นต์ คลาวด์ เพื่อเสริมหรือแทนที่ทั้งหมดหรือบางส่วนของข้อตกลงนี้</p>

<p>เทนเซ็นต์ คลาวด์ ถือเป็นเจ้าของทรัพย์สินทางปัญญาทั้งหมดของซอฟต์แวร์นี้ ซอฟต์แวร์นี้เป็นเพียงสิทธิ์การให้ใช้งาน ไม่ใช่การขาย บริษัท เทนเซ็นต์ คลาวด์ เปิดให้คุณมีสิทธิ์คัดลอก ดาวน์โหลด ติดตั้ง ใช้ หรือรับประโยชน์จากฟังก์ชันหรือทรัพย์สินทางปัญญาของซอฟต์แวร์นี้ เพียงแต่ในกรณีที่คุณปฏิบัติตามข้อตกลงทั้งหมดในเงื่อนไขของข้อตกลงนี้</p>

<h3>I. สิทธิ์ที่ได้รับอนุญาตให้ใช้งาน</h3>
<ol>
   <li>คุณสามารถใช้ซอฟต์แวร์นี้ในวัตถุประสงค์ที่ไม่ใช่การค้าหรือในการใช้เพื่อการค้า (ขึ้นอยู่กับเงื่อนไขในสัญญาอนุญาต) โดยไม่ต้องจ่ายค่าใบอนุญาตลิขสิทธิ์ซอฟต์แวร์</li>
   <li>คุณสามารถปรับแก้ซอร์สโค้ดที่มากับผลิตภัณฑ์ของ เทนเซ็นต์ คลาวด์ (หากมี) หรือสไตล์/เทมเพลตต่าง ๆ เพื่อให้เข้ากับความต้องการของเว็บไซต์ของคุณ โดยไม่เกินขอบเขตและข้อจำกัดที่ระบุในสัญญา</li>
   <li>คุณเป็นเจ้าของข้อมูลสมาชิกทั้งหมดในเว็บไซต์ที่คุณสร้างด้วยซอฟต์แวร์นี้ รวมถึงบทความและข้อมูลที่เกี่ยวข้อง และต้องรับผิดชอบในการตรวจสอบและรักษาข้อมูลในเว็บไซต์เพื่อไม่ละเมิดสิทธิของผู้อื่น คุณต้องรับผิดชอบในการใช้ซอฟต์แวร์และบริการของ เทนเซ็นต์ คลาวด์ และต้องชดใช้ความเสียหายทั้งหมดในกรณีที่เกิดความเสียหายแก่ เทนเซ็นต์ คลาวด์ หรือผู้ใช้งาน</li>
   <li>หากคุณต้องการใช้ซอฟต์แวร์หรือบริการของ เทนเซ็นต์ คลาวด์ ในวัตถุประสงค์ทางการค้า คุณต้องเชื่อมั่นว่าคุณปฏิบัติตามกฎหมายของสาธารณรัฐประชาชนจีนที่เกี่ยวข้อง หากคุณต้องการการสนับสนุนทางเทคนิคหรือข้อมูลสนับสนุนทางเทคนิค คุณควรติดต่ออย่างเป็นทางการได้ที่ (https://www.discuz.vip/)</li>
   <li>คุณสามารถดาวน์โหลดแอปพลิเคชันที่เหมาะกับเว็บไซต์ของคุณจากบริการศูนย์แอปพลิเคชันที่ เทนเซ็นต์ คลาวด์ ให้บริการ แต่คุณต้องชำระค่าใช้จ่ายที่เกี่ยวข้องแก่ผู้พัฒนา/เจ้าของแอปพลิเคชันนั้น</li>
</ol>

<h3>II. ข้อจำกัดและข้อกำหนดในสัญญา</h3>
<ol>
   <li>ห้ามให้เช่าซอฟต์แวร์นี้หรือใช้สิทธิ์การค้าในธุรกิจที่เกี่ยวข้อง เข้าร้านค้าหรืออนุญาตการใช้งานย่อย โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร</li>
   <li>ไม่ว่าจะเป็นในลักษณะใด ไม่ว่าจะผ่านการปรับแก้หรือประดิษฐ์อย่างไร ในกรณีที่ใช้ส่วนหนึ่งหรือทั้งหมดของผลิตภัณฑ์ของ เทนเซ็นต์ คลาวด์ และยังไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรนั้น คำว่า "Powered by Discuz!" และลิงก์ (https://www.discuz.vip/) ที่ปรากฏที่ส่วนท้ายของหน้าเว็บ และลิงก์ที่เชื่อมโยงไปยังศูนย์แอปพลิเคชันในระบบหลังบ้านของซอฟต์แวร์ (https://addon.dismall.com) จะต้องถูกเก็บไว้โดยไม่สามารถลบหรือแก้ไขหรือแทนที่ได้</li>
   <li>ห้ามมิให้สร้างเวอร์ชันที่ถูกพัฒนาออกมาจากซอฟต์แวร์นี้ รวมถึงเวอร์ชันที่แก้ไขหรือเปลี่ยนแปลงในทุกกรณีเพื่อการแจกจ่ายซ้ำ</li>
   <li>คุณไม่ได้รับอนุญาตให้ทำวิศวกรรมย้อนกลับ ประกอบย้อนกลับ ถอดรหัส หรืออื่นใด ในการทำงานกับแอปพลิเคชันที่คุณดาวน์โหลดจากศูนย์แอปพลิเคชัน โดยที่ยังไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร คุณไม่ได้รับอนุญาตให้คัดลอก ปรับแก้ เชื่อมโยง นำไปใช้ในที่อื่น รวบรวม เผยแพร่ จัดพิมพ์ พัฒนาผลิตภัณฑ์ที่เกี่ยวข้องหรืองานอื่น ๆ โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร</li>
   <li>หากคุณไม่ปฏิบัติตามข้อกำหนดในสัญญานี้ สิทธิการใช้งานของคุณจะถูกยกเลิก และสิทธิที่ได้รับจะถูกยึดคืน และในเวลาเดียวกันคุณจะต้องรับผิดชอบตามกฎหมายที่เกี่ยวข้อง</li>
</ol>

<h3>III. ข้อจำกัดความรับผิดและประกาศความไม่รับผิด</h3>
<ol>
   <li>ซอฟต์แวร์นี้และไฟล์ที่แนบมาไม่ได้รับการรับประกันหรือรับผิดชอบใด ๆ ทั้งสิ้น ไม่ว่าในรูปแบบการชดเชยที่ชัดเจนหรือที่ไม่ชัดเจน</li>
   <li>ผู้ใช้มีความสมัครใจในการใช้ซอฟต์แวร์นี้ คุณต้องเข้าใจความเสี่ยงในการใช้ซอฟต์แวร์นี้ เราไม่ขอรับผิดชอบในการให้บริการเทคนิคหรือการรับประกันการใช้งานใด ๆ และไม่รับผิดชอบในปัญหาที่เกิดขึ้นจากการใช้ซอฟต์แวร์นี้</li>
   <li>บริษัท เทนเซ็นต์ คลาวด์ ไม่รับผิดชอบในบทความหรือข้อมูลในเว็บไซต์หรือเว็บบอร์ดที่สร้างขึ้นโดยใช้ซอฟต์แวร์นี้ คุณต้องรับผิดชอบในทุกข้อ ไม่ว่าจะเป็นอะไรก็ตาม</li>
   <li>ระบบศูนย์แอปพลิเคชันอย่างเป็นทางการไม่สามารถเฝ้าดูแอปพลิเคชันที่บุคคลที่สามอัปโหลดขึ้นมายังศูนย์แอปพลิเคชันได้ทั่วถึง ดังนั้น จึงไม่สามารถรับประกันความถูกต้องตามหลักของกฎหมาย ความปลอดภัย ความครบถ้วน ความสมบุรณ์ หรือคุณภาพของแอปพลิเคชันเหล่านี้ เมื่อคุณดาวน์โหลดแอปพลิเคชันจากศูนย์แอปพลิเคชัน คุณต้องยินยอมที่จะพิจารณาและรับผิดชอบความเสี่ยงทั้งหมดเองโดยไม่ขึ้นอยู่กับว่าเป็นบริษัท เทนเซ็นต์ คลาวด์ หรือระบบศูนย์แอปพลิเคชันอย่างเป็นทางการ อย่างไรก็ตาม ภายใต้เงื่อนไขใด ๆ ระบบศูนย์แอปพลิเคชันอย่างเป็นทางการยังคงมีสิทธิ์ทางกฎหมายในการหยุดให้บริการและดำเนินการที่จำเป็น รวมถึงการถอนการติดตั้งแอปพลิเคชันที่เกี่ยวข้อง ระงับบริการทั้งหมดหรือบางส่วน การบันทึกข้อมูลที่เกี่ยวข้อง และรายงานให้แก่หน่วยงานที่เกี่ยวข้อง บริษัท เทนเซ็นต์ คลาวด์ และระบบศูนย์แอปพลิเคชันอย่างเป็นทางการ ไม่ขอรับผิดชอบต่อความสูญเสียใด ๆ ที่อาจเกิดขึ้นกับคุณหรือบุคคลที่สาม</li>
   <li>บริษัท เทนเซ็นต์ คลาวด์ ไม่รับประกันความเที่ยงตรง ความปลอดภัย และความถูกต้องของซอฟต์แวร์และบริการที่ซอฟต์แวร์ให้บริการ ในกรณีที่มีสาเหตุอุบัติการณ์ที่ไม่สามารถควบคุมได้ เช่น ปัญหาที่เกิดขึ้นจากความผิดพลาดอันไม่คาดคิด การโจมตีของผู้บุกรุก การตัดการจ่ายไฟฟ้า และอื่น ๆ และทำให้การใช้งานซอฟต์แวร์และบริการหยุดชะงักหรือถูกยุติ ทำให้คุณเสียหาย คุณยินยอมที่จะสละสิทธิ์ในการดำเนินการใด ๆ เพื่อดำเนินคดีต่อบริษัท เทนเซ็นต์ คลาวด์</li>
   <li>บริษัท เทนเซ็นต์ คลาวด์ ขอเรียนให้ทราบเป็นพิเศษว่า เพื่อรักษาสิทธิ์ในการพัฒนาธุรกิจและการปรับเปลี่ยน บริษัท เทนเซ็นต์ คลาวด์ มีสิทธิ์ในการแก้ไขเนื้อหาของบริการหรือระงับหรือยุติการใช้งานซอฟต์แวร์และบริการบางส่วนหรือทั้งหมด โดยไม่ต้องแจ้งล่วงหน้า การแก้ไขนี้จะถูกประกาศบนหน้าเว็บไซต์ของบริษัท เทนเซ็นต์ คลาวด์ และถือว่าเป็นการแจ้งให้ทราบทันที หากบริษัท เทนเซ็นต์ คลาวด์ ดำเนินการแก้ไขหรือยุติการใช้งานซอฟต์แวร์และบริการบางส่วนหรือทั้งหมด และทำให้คุณเสียหาย บริษัท เทนเซ็นต์ คลาวด์ ไม่ต้องรับผิดชอบต่อคุณหรือบุคคลที่สามใด ๆ</li>
</ol>

<p>ข้อมูลรายละเอียดเกี่ยวกับข้อตกลงสิทธิ์ใช้งานสุดท้ายของผู้ใช้สำหรับผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ และสิทธิ์ใช้งานทางธุรกิจและบริการทางเทคโนโลยี ถูกให้โดยบริษัท เทนเซ็นต์ คลาวด์ โดยเฉพาะ บริษัท เทนเซ็นต์ คลาวด์ มีสิทธิ์ในการแก้ไขข้อตกลงสิทธิ์ใช้งานและราคาบริการโดยไม่ต้องแจ้งล่วงหน้า ข้อตกลงหรือราคาหลังจากการแก้ไขนั้นจะมีผลใช้บังคับต่อผู้ใช้สิทธิ์ใหม่ตั้งแต่วันที่เปลี่ยนแปลง</p>

<p>เมื่อคุณเริ่มต้นติดตั้งผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ นั้นถือว่าคุณเข้าใจและยอมรับข้อตกลงทั้งหมดในข้อความนี้ ระหว่างการใช้สิทธิ์ตามข้อความนี้ คุณจะถูกผูกมัดด้วยข้อกำหนดและข้อจำกัดที่เกี่ยวข้อง การกระทำนอกเหนือขอบเขตของสิทธิ์ใช้งานในข้อตกลงนี้จะถือว่าละเมิดสิทธิ์ในการใช้งานและเป็นการละเมิดลิขสิทธิ์ เรามีสิทธิ์ในการยุติสิทธิ์ใช้งานอันไม่พึงประสงค์และเรียกร้องให้หยุดการให้สิทธิ์ใช้งาน และเราจะสงวนสิทธิ์ในการดำเนินการตามความเหมาะสม</p>

<p>การอธิบายข้อตกลงนี้ ข้อตัดสินใจ และการแก้ไขข้อข้อพิพากษาที่เกี่ยวข้อง มีผลใช้บังคับตามกฎหมายของสาธารณรัฐประชาชนจีน</p>

<p>หากคุณและ เทนเซ็นต์ คลาวด์ มีข้อโต้แย้งหรือข้อพิพากษาใด ๆ คุณควรพิจารณาการแก้ข้อโต้แย้งอย่างเป็นกัลยามิตรเป็นสิ่งแรก หากการเจรจาไม่เป็นผล คุณยินยอมที่จะยื่นข้อโต้แย้งหรือข้อพิพากษาต่อศาลปกครองที่มีอำนาจในพื้นที่ของ เทนเซ็นต์ คลาวด์ ที่ตั้ง ที่เขตเมืองฮายเติน ประเทศจีน บริษัท เทนเซ็นต์ คลาวด์ สงวนสิทธิ์ในการอธิบายและแก้ไขข้อตกลงทุกประการตามที่เห็นสมควรและการเปลี่ยนแปลง</p>

<p>(สิ้นสุดข้อความ)</p>

<p align="right">Discuz!</p>

</div>',

	'php8_tips' => 'สวัสดี ดิสคัสที่คุณกำลังติดตั้งไม่รองรับ PHP 9 กรุณาดาวน์เกรดเป็น PHP 8.0 ก่อน จากนั้นค่อยลองใหม่!',
	'no_utf8_tips' => 'สวัสดี เวอร์ชันที่คุณใช้เป็นเวอร์ชันเข้ารหัสภาษาท้องถิ่น เช่น GBK / BIG-5 ซึ่งไม่ใช่เวอร์ชันหลักสำหรับแจกจ่ายอีกต่อไป หากคุณวางแผนที่จะสร้างเว็บไซต์ใหม่ ขอแนะนำ [อย่างยิ่ง] ให้ใช้เวอร์ชันล่าสุดอย่างเป็นทางการ นั่นคือ UTF-8',
	'no_latest_tips' => 'สวัสดี คุณกำลังติดตั้งเวอร์ชันที่เก่าแล้ว และอาจมีข้อบกพร่องรวมไปถึงความเสี่ยงด้านความปลอดภัย หากเป็นไปได้ ขอแนะนำให้คุณติดตั้งเวอร์ชันภาษาไทยล่าสุดอย่างเป็นทางการจะดีกว่า',
	'unstable_tips' => 'สวัสดี คุณกำลังติดตั้งเวอร์ชันที่ไม่เป็นทางการ อาจมีบั๊กหรือปัญหาที่ไม่รู้จักได้ หากคุณวางแผนที่จะสร้างเว็บไซต์หรือซื้อปลั๊กอินใหม่ ขอแนะนำให้คุณติดตั้งเวอร์ชันภาษาไทยล่าสุดอย่างเป็นทางการจะดีกว่า',
	'next_tips' => '\r\nคลิก [ตกลง] เพื่อไปหน้าดาวน์โหลดดิสคัสภาษาไทยล่าสุด หรือคลิก [ยกเลิก] เพื่อติดตั้งต่อไป (ไม่แนะนำ)',

	'uc_installed' => 'คุณได้ติดตั้ง UCenter ไว้อยู่แล้ว หากคุณจำเป็นต้องติดตั้งใหม่ให้ลบไฟล์ data/install.lock',
	'i_agree' => 'ฉันได้อ่านและยอมรับข้อตกลงทั้งหมด',
	'supportted' => 'สนับสนุน',
	'unsupportted' => 'ไม่สนับสนุน',
	'max_size' => 'สนับสนุน/ขนาดสูงสุด',
	'project' => 'รายการ',
	'ucenter_required' => 'ขั้นต่ำ',
	'ucenter_best' => 'แนะนำ',
	'curr_server' => 'เซิร์ฟเวอร์ปัจจุบัน',
	'env_check' => 'ความต้องการของระบบ',
	'os' => 'ระบบปฏิบัติการ',
	'php' => 'เวอร์ชัน PHP',
	'attachmentupload' => 'อัปโหลดไฟล์',
	'unlimit' => 'ไม่จำกัด',
	'version' => 'เวอร์ชัน',
	'gdversion' => 'เวอร์ชัน GD',
	'allow' => 'อนุญาต',
	'unix' => 'คลาส Unix',
	'diskspace' => 'พื้นที่ดิสก์',
	'opcache' => 'OPcache',
	'curl' => 'ไลบรารี cURL',
	'priv_check' => 'ตรวจสอบสิทธิโฟลเดอร์',
	'func_depend' => 'ตรวจสอบฟังก์ชัน',
	'func_name' => 'ชื่อฟังก์ชัน',
	'check_result' => 'ผลลัพธ์การทดสอบ',
	'suggestion' => 'คำแนะนำ',
	'advice_mysqli' => 'กรุณาตรวจสอบว่าโมดูล mysqli ได้โหลดอย่างถูกต้องแล้ว',
	'advice_fopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_xml' => 'ตรวจสอบดูว่าสนับสนุน PHP สำหรับ XML หรือไม่ โปรดติดต่อผู้ให้บริการโฮสต์เพื่อตรวจสอบการเปิดคุณลักษณะนี้',
	'none' => 'ไม่มี',
	'undefine_func' => 'ไม่มีฟังก์ชันนี้อยู่',
	'mysqli_unsupport' => 'กรุณาตรวจสอบว่าโมดูล mysqli ได้โหลดอย่างถูกต้องแล้ว',

	'dbhost' => 'ที่อยู่เซิร์ฟเวอร์ฐานข้อมูล',
	'dbuser' => 'ชื่อผู้ใช้',
	'dbpw' => 'รหัสผ่าน',
	'dbname' => 'ชื่อฐานข้อมูล',
	'tablepre' => 'คำนำหน้าตาราง',

	'ucfounderpw' => 'รหัสผ่าน',
	'ucfounderpw2' => 'ยืนยันรหัสผ่าน',

	'clear_dir' => 'ล้างเนื้อหาในโฟล์เดอร์',
	'innodb' => 'การแปลงตารางข้อมูล InnoDB',
	'select_db' => 'เลือกฐานข้อมูล',
	'create_table' => 'สร้างตารางข้อมูล',
	'succeed' => 'สำเร็จ',
	'failed' => 'ไม่สำเร็จ',

	'init_table_data' => 'เริ่มต้นข้อมูลในตารางฐานข้อมูล',
	'install_data' => 'กำลังติดตั้งข้อมูล',
	'install_test_data' => 'กำลังติดตั้งข้อมูลเพิ่มเติม',

	'method_undefined' => 'ไม่กำหนดวิธี',
	'database_nonexistence' => 'ไม่พบฐานข้อมูลที่ต้องการ',
	'skip_current' => 'ข้ามขั้นตอนนี้',
	'topic' => 'หัวข้อ',
	'install_finish' => 'ติดตั้งเว็บไซต์เสร็จสมบูรณ์ ขอบคุณสำหรับการสนับสนุนของคุณ!',
	'install_finish_next' => 'ขั้นตอนต่อไป คุณสามารถ:',
	'finish_btn_admin' => 'เข้าสู่ระบบจัดการเว็บไซต์ (AdminCP)',
	'finish_btn_cloudaddon' => 'ติดตั้งปลั๊กอิน/เทมเพลต',
	'finish_btn_direct' => 'เยี่ยมชมหน้าแรกเว็บไซต์',

);

$msglang = array(
	'config_nonexistence' => 'ไม่พบไฟล์ config.inc.php ในระบบ ตัวช่วยการติดตั้งไม่สามารถดำเนินการต่อไปได้ กรุณาใช้เครื่องมือ FTP เพื่ออัปโหลดไฟล์ดังกล่าวและลองใหม่อีกครั้ง',
);

?>