<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: install_lang.php 36287 2016-12-12 03:59:05Z nemohou $
 */

if(!defined('IN_COMSENZ')) {
	exit('Access Denied');
}

define('UC_VERNAME', 'ภาษาไทย');
$lang = array(
	'SC_UTF8' => 'ภาษาไทย UTF-8', /*jaideejung007*/
	'TC_UTF8' => '繁体中文 UTF8 版',

	'title_install' => 'โปรแกรมติดตั้ง '.SOFT_NAME.'',
	'agreement_yes' => 'ยอมรับ',
	'agreement_no' => 'ปฏิเสธ',
	'notset' => 'ไม่จำกัด',
	'enable' => 'เปิด',
	'disable' => 'ปิด',

	'message_title' => 'คำชี้แจง',
	'error_message' => 'ข้อความผิดพลาด',
	'message_return' => 'คลิกที่นี่เพื่อย้อนกลับ',
	'return' => 'ย้อนกลับ',
	'install_wizard' => 'โปรแกรมติดตั้ง',
	'config_nonexistence' => 'ไฟล์กำหนดค่าไม่มี',
	'nodir' => 'ไม่มีโฟลเดอร์',
	'redirect' => 'เบราว์เซอร์จะไปยังหน้าต่อไปโดยอัตโนมัติ คุณไม่ต้องกระทำการใด ๆ<br>หากเบราว์เซอร์ของคุณไม่เปลี่ยนเส้นทางให้อัตโนมัติ กรุณาคลิกที่นี่',
	'auto_redirect' => 'เบราว์เซอร์จะข้ามไปยังหน้าต่อไปโดยอัตโนมัติ',
	'database_errno_1064' => 'เกิดข้อผิดพลาดทางไวยากรณ์ของ SQL',

	'dbpriv_createtable' => 'คุณไม่ได้รับสิทธิ์ในการ CREATE TABLE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_insert' => 'คุณไม่ได้รับสิทธิ์ในการ INSERT ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_select' => 'คุณไม่ได้รับสิทธิ์ในการ SELECT ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_update' => 'คุณไม่ได้รับสิทธิ์ในการ UPDATE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_delete' => 'คุณไม่ได้รับสิทธิ์ในการ DELETE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',
	'dbpriv_droptable' => 'คุณไม่ได้รับสิทธิ์ในการ DROP TABLE ของฐานข้อมูล ไม่สามารถดำเนินการติดตั้งต่อไปได้',

	'db_not_null' => 'ในระบบฐานข้อมูลมีการติดตั้ง UCenter แล้ว  หากคุณทำการติดตั้งต่อ ข้อมูลเดิมจะถูกล้างออก',
	'db_drop_table_confirm' => 'การติดตั้งต่อจะลบข้อมูลเดิมทั้งหมด คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ',

	'writeable' => 'เขียนได้',
	'unwriteable' => 'เขียนไม่ได้',
	'old_step' => 'ขั้นตอนก่อนหน้า',
	'new_step' => 'ขั้นตอนถัดไป',

	'database_errno_2003' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล กรุณาตรวจสอบฐานข้อมูลว่าเชื่อมต่ออยู่เซิร์ฟเวอร์ฐานข้อมูลถูกต้องหรือไม่',
	'database_errno_1044' => 'ไม่สามารถสร้างฐานข้อมูลใหม่ กรุณาตรวจสอบชื่อฐานข้อมูลที่กรอกให้ถูกต้อง',
	'database_errno_1045' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล กรุณาตรวจสอบชื่อผู้ใช้ฐานข้อมูลและรหัสผ่านให้ถูกต้อง',
	'database_connect_error' => 'การเชื่อมต่อฐานข้อมูลผิดพลาด',

	'step_title_1' => 'ตรวจสอบก่อนติดตั้ง',
	'step_title_2' => 'กำหนดข้อมูลระบบ',
	'step_title_3' => 'สร้างฐานข้อมูล',
	'step_title_4' => 'ติดตั้ง',
	'step_env_check_title' => 'เริ่มต้นการติดตั้ง',
	'step_env_check_desc' => 'ตรวจสอบระบบการเข้าถึงของไฟล์และโฟลเดอร์',
	'step_db_init_title' => 'ติดตั้งฐานข้อมูล',
	'step_db_init_desc' => 'ดำเนินการติดตั้งฐานข้อมูลและสร้างบัญชีผู้ดูแลระบบ',

	'step1_file' => 'โฟลเดอร์และไฟล์',
	'step1_need_status' => 'สถานะที่ต้องการ',
	'step1_status' => 'สถานะปัจจุบัน',
	'not_continue' => 'กรุณาตรวจสอบโฟลเดอร์/ไฟล์ สีแดงและลองอีกครั้ง',

	'tips_dbinfo' => 'กรอกข้อมูลระบบฐานข้อมูล',
	'tips_dbinfo_comment' => '',
	'tips_admininfo' => 'กรอกข้อมูลผู้ดูแลระบบ',
	'step_ext_info_title' => 'การติดตั้งสำเร็จ',
	'step_ext_info_comment' => 'คลิกที่นี่เพื่อเข้าสู่ระบบ',

	'ext_info_succ' => 'ติดตั้งเรียบร้อยแล้ว',
	'install_submit' => 'ตกลง',
	'install_locked' => 'การติดตั้งถูกล็อกแล้ว เนื่องจากได้มีการติดตั้งแล้วก่อนหน้านี้ หากคุณต้องการติดตั้งใหม่ กรุณาลบไฟล์ที่มีอยู่บนเซิร์ฟเวอร์ก่อน<br /> '.str_replace(ROOT_PATH, '', $lockfile),
	'error_stuck_msg' => 'การติดตั้งไม่มีความคืบหน้าเป็นเวลานานแล้ว อาจเกิดข้อผิดพลาดเนื่องจากการขอข้อมูลที่เกี่ยวข้องหมดเวลาหรือเซิร์ฟเวอร์มีข้อผิดพลาดอย่างรุนแรงทำให้การทำงานถูกยกเลิก',
	'error_quit_msg' => 'คุณต้องแก้ปัญหาข้างต้นก่อน ไม่เช่นนั้นการติดตั้งจะไม่สามารถดำเนินการต่อไปได้',

	'step_app_reg_title' => 'ตั้งค่าระบบ',
	'step_app_reg_desc' => 'ทดสอบระบบเซิร์ฟเวอร์และตั้งค่า UCenter',
	'tips_ucenter' => 'กรุณากรอกข้อมูลของ UCenter ที่กำหนดไว้',
	'tips_ucenter_comment' => 'UCenter เป็นผลิตภัณฑ์หลักของบริษัทฯ Comsenz ซึ่ง Discuz! Board ต้องติดตั้งและพึ่งพาการทำงานของโปรแกรมนี้ หากคุณติดตั้ง UCenter ไว้แล้ว กรุณากรอกข้อมูลด้านล่าง หากคุณยังไม่มีและยังไม่ได้ติดตั้ง UCenter กรุณาไปที่ <a href="https://www.discuzthai.com/" target="blank">DiscuzThai</a> เพื่อดาวน์โหลด UCenter เวอร์ชันภาษาไทย แล้วทำการติดตั้งเพื่อดำเนินการต่อไป',

	'advice_mysqli_connect' => 'กรุณาตรวจสอบว่าโมดูล mysqli มีการโหลดอย่างถูกต้องแล้ว',
	'advice_xml_parser_create' => 'ฟังก์ชันนี้ต้องใช้ PHP เพื่อรองรับ XML กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_json_encode' => 'ฟังก์ชันนี้ต้องใช้ PHP เพื่อรองรับ JSON กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_fsockopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_pfsockopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_stream_socket_client' => 'ฟังก์ชันนี้ต้องการตัวเลือก stream_socket_client ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_curl_init' => 'ฟังก์ชันนี้ต้องการตัวเลือก curl_init ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',

	'ucurl' => 'ที่อยู่ URL ของ UCenter',
	'ucpw' => 'รหัสผ่านของ UCenter',
	'ucip' => 'ที่อยู่ IP ของ UCenter',
	'ucenter_ucip_invalid' => 'รูปแบบผิดพลาด กรุณากรอกที่อยู่ IP ให้ถูกต้อง',
	'ucip_comment' => 'ที่อยู่ IP ไม่จำเป็นต้องกรอก',

	'tips_siteinfo' => 'กรุณากรอกข้อมูลเว็บไซต์',
	'sitename' => 'ชื่อเว็บไซต์',
	'siteurl' => 'URL เว็บไซต์',

	'forceinstall' => 'กำลังติดตั้ง',
	'dbinfo_forceinstall_invalid' => 'ในฐานข้อมูลปัจจุบันมีตารางที่มีคำนำหน้าชื่อเดียวกันกับตารางที่ต้องการติดตั้ง คุณสามารถเปลี่ยน "คำนำหน้าชื่อตาราง" เพื่อหลีกเลี่ยงการลบข้อมูลเก่า หรือหากต้องการคุณสามารถเลือก "ติดตั้งแบบบังคับ" ซึ่งจะลบข้อมูลเก่าและไม่สามารถกู้คืนได้',

	'click_to_back' => 'คลิกกลับไปที่ขั้นตอนที่แล้ว',
	'adminemail' => 'อีเมลผู้ดูแล',
	'adminemail_comment' => 'ใช้ในการส่งรายงานข้อผิดพลาด',
	'dbhost_comment' => 'โดยทั่วไปจะเป็น 127.0.0.1 หรือ localhost',
	'dbname_comment' => 'ชื่อฐานข้อมูลใช้สำหรับติดตั้ง Discuz!',
	'dbuser_comment' => 'ชื่อผู้ใช้ฐานข้อมูลของคุณ',
	'dbpw_comment' => 'รหัสผ่านฐานข้อมูลของคุณ',
	'tablepre_comment' => 'ถ้าติดตั้งในฐานข้อมูลเดียวกันกรุณาแก้ไขคำนำหน้าตารางใหม่',
	'forceinstall_check_label' => 'ฉันต้องการลบข้อมูลที่ติดตั้งไว้ก่อนหน้านี้!!!',
	'initdbresult_succ' => 'ติดตั้งฐานข้อมูลเสร็จสมบูรณ์',
	'initdbdataresult_succ' => 'เริ่มต้นการเตรียมข้อมูลสำหรับติดตั้งฐานข้อมูลเรียบร้อยแล้ว',
	'initsys' => 'กำลังเริ่มต้นการติดตั้งระบบ',

	'uc_url_empty' => 'คุณไม่ได้กรอก URL ของ UCenter กรุณากลับไปกรอก',
	'uc_url_invalid' => 'รูปแบบของ URL ผิดพลาด',
	'uc_url_unreachable' => 'ที่อยู่ URL ของ UCenter อาจกรอกไม่ถูกต้อง และสาเหตุที่เป็นไปได้มีดังนี้:<br />1. เส้นทาง UCenter ไม่ถูกต้องหรือมีสถานะผิดปกติ<br />2. ปัญหาที่ไม่สามารถเรียกใช้การสอบถามสถานะ UCenter หรือถูกบล็อก<br />3. การตั้งค่าในระบบหลังบ้านของ UCenter ในส่วนของ "การเพิ่มฟังก์ชั่นของโปรแกรมผ่าน URL" ยังไม่ได้เปิดใช้งาน',
	'uc_ip_invalid' => 'ไม่สามารถแปลงชื่อโดเมนเป็นที่อยู่ IP ของเซิร์ฟเวอร์เว็บไซต์ได้ กรุณากรอก IP ของเว็บไซต์แทน',
	'uc_admin_invalid' => 'การยืนยันรหัสผ่านผู้ก่อตั้ง UCenter ไม่สำเร็จ สาเหตุที่เป็นไปได้คือ:<br />1. รหัสผ่านผู้ก่อตั้ง UCenter ไม่ถูกต้อง<br />2. ชื่อผู้ใช้ของผู้ก่อตั้งและที่อยู่ IP ถูกล็อก เนื่องจากกรอกรหัสผ่านผิดซ้ำหลายครั้ง<br />3. การตั้งค่าในระบบหลังบ้านของ UCenter ในส่วนของ "การเพิ่มฟังก์ชั่นของโปรแกรมผ่าน URL" ยังไม่ได้เปิดใช้งาน',
	'uc_data_invalid' => 'การเชื่อมต่อล้มเหลว กรุณาตรวจสอบที่อยู่ URL ของ UCenter ให้ถูกต้อง',
	'uc_dbcharset_incorrect' => 'ชุดอักขระฐานข้อมูล UCenter ไม่สอดคล้องกับชุดอักขระของโปรแกรมปัจจุบัน',
	'uc_api_add_app_error' => 'เพิ่มโปรแกรมไปยัง UCenter ผิดพลาด',
	'uc_dns_error' => 'DNS ของ UCenter เกิดข้อผิดพลาด กรุณากลับไปกรอกที่อยู่ IP ของ UCenter',

	'ucenter_ucurl_invalid' => 'URL ของ UCenter ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'ucenter_ucpw_invalid' => 'รหัสผ่านของ UCenter ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'siteinfo_siteurl_invalid' => 'URL ของเว็บไซต์ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'siteinfo_sitename_invalid' => 'ชื่อเว็บไซต์ว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbhost_invalid' => 'เซิร์ฟเวอร์ฐานข้อมูลว่างหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbuser_invalid' => 'ชื่อผู้ใช้ฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_dbpw_invalid' => 'รหัสผ่านฐานข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_adminemail_invalid' => 'อีเมลผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'dbinfo_tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_username_invalid' => 'ชื่อผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_email_invalid' => 'อีเมลผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_password_invalid' => 'รหัสผ่านผู้ดูแลระบบว่างเปล่าหรือผิดรูปแบบ กรุณากลับไปตรวจสอบ',
	'admininfo_password2_invalid' => 'ยืนยันรหัสผ่านผู้ดูแลระบบว่างเปล่าหรือไม่ตรงกัน กรุณากลับไปตรวจสอบ',

	'install_dzstandalone' => '<div class="selradio"><input type="radio" id="install_ucenter_standalone" name="install_ucenter" value="standalone" onclick="if(this.checked)$(\'form_items_2\').style.display=\'none\';" /><label for="install_ucenter_standalone">ติดตั้ง Discuz! X ใหม่ (โหมดสแตนด์อโลน)</label></div>',
	'install_dzfull' => '<div class="selradio"><input type="radio" id="install_ucenter_yes"'.(getgpc('install_ucenter') != 'no' ? ' checked="checked"' : '').' name="install_ucenter" value="yes" onclick="if(this.checked)$(\'form_items_2\').style.display=\'none\';" /><label for="install_ucenter_yes">ติดตั้ง Discuz! X และ UCenter Server ใหม่</label></div>',
	'install_dzonly' => '<div class="selradio"><input type="radio" id="install_ucenter_no"'.(getgpc('install_ucenter') == 'no' ? ' checked="checked"' : '').' name="install_ucenter" value="no" onclick="if(this.checked)$(\'form_items_2\').style.display=\'\';" /><label for="install_ucenter_no">ติดตั้งเฉพาะ Discuz! X (เชื่อมต่อกับ UCenter Server ที่เคยติดตั้งไว้แล้ว)</label></div>',

	'username' => 'ชื่อผู้ดูแลระบบ',
	'email' => 'อีเมล',
	'password' => 'รหัสผ่าน',
	'password_comment' => 'รหัสผ่านผู้ดูแลระบบไม่สามารถเว้นว่างได้',
	'password2' => 'ยืนยันรหัสผ่าน',

	'admininfo_invalid' => 'ข้อมูลของผู้ดูแลระบบไม่สมบูรณ์ กรุณาตรวจสอบชื่อผู้ดูแลระบบ รหัสผ่าน และที่อยู่อีเมลของผู้ดูแลระบบให้ถูกต้องและครบถ้วน',
	'dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่ากรุณากรอกชื่อฐานข้อมูล',
	'tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือรูปแบบไม่ถูกต้องกรุณาตรวจสอบ',
	'admin_username_invalid' => 'ชื่อผู้ดูแลระบบไม่ถูกต้อง ไม่ควรเกิน 15 ตัวอักษรภาษาอังกฤษ และไม่ควรมีอักขระพิเศษ เช่น ภาษาจีน ตัวอักษร หรือตัวเลขเท่านั้นที่สามารถใช้งานได้',
	'admin_password_invalid' => 'รหัสผ่านไม่ตรงกันกับที่กรอกไว้ด้านบน กรุณากรอกรหัสผ่านใหม่อีกครั้ง',
	'admin_email_invalid' => 'ข้อผิดพลาด ที่อยู่อีเมลนี้ใช้ไปแล้วหรือรูปแบบอีเมลที่ไม่ถูกต้อง กรุณาใช้อีเมลอื่น',
	'admin_invalid' => 'ข้อมูลผู้ดูแลระบบของคุณยังไม่ครบถ้วน กรุณากรอกข้อมูลในทุก ๆ ช่องให้ครบถ้วน',
	'admin_exist_password_error' => 'ผู้ใช้งานนี้มีอยู่แล้วในระบบ หากคุณต้องการตั้งผู้ใช้งานนี้เป็นผู้ดูแลระบบของเว็บบอร์ด กรุณากรอกรหัสผ่านของผู้ใช้งานนี้ให้ถูกต้อง หรือคุณจะเปลี่ยนชื่อผู้ดูแลระบบของเว็บบอร์ดนี้ใหม่ก็ได้เช่นเดียวกัน',

	'tagtemplates_subject' => 'ชื่อ',
	'tagtemplates_uid' => 'ID ผู้ใช้',
	'tagtemplates_username' => 'โพสต์โดย',
	'tagtemplates_dateline' => 'วันที่',
	'tagtemplates_url' => 'ที่อยู่หัวเรื่อง',

	'uc_version_incorrect' => 'เวอร์ชันเซิร์ฟเวอร์ UCenter ของคุณต่ำเกินไป กรุณาอัปเกรดเซิร์ฟเวอร์ UCenter เป็นเวอร์ชันล่าสุดก่อน สามารถดาวน์โหลดได้ที่: http://discuzthai.com/',
	'config_unwriteable' => 'ตัวช่วยการติดตั้งไม่สามารถเขียนไฟล์ config.inc.php ให้กำหนดสิทธิ์ไฟล์นี้เป็น (777)',

	'install_in_processed' => 'กำลังติดตั้ง...',
	'install_succeed' => 'ติดตั้งเสร็จสมบูรณ์ คลิกที่นี่เพื่อไปยังเว็บไซต์ของคุณ',

	'init_credits_karma' => 'พลังน้ำใจ',
	'init_credits_money' => 'เงิน',

	'init_postno0' => 'เจ้าของโพสต์',
	'init_postno1' => 'เมนต์แรก',
	'init_postno2' => 'เมนต์สอง',
	'init_postno3' => 'เมนต์สาม',

	'init_support' => 'สนับสนุน',
	'init_opposition' => 'คัดค้าน',

	'init_group_0' => 'สมาชิก',
	'init_group_1' => 'ผู้ดูแลระบบ',
	'init_group_2' => 'ผู้ช่วยผู้ดูแลระบบ',
	'init_group_3' => 'ผู้ดูแลบอร์ด',
	'init_group_4' => 'แบนห้ามโพสต์',
	'init_group_5' => 'แบนห้ามเข้า',
	'init_group_6' => 'แบน IP',
	'init_group_7' => 'ผู้เยี่ยมชม',
	'init_group_8' => 'รอยืนยัน',
	'init_group_9' => 'Daemon',
	'init_group_10' => 'Newbie',
	'init_group_11' => 'Member',
	'init_group_12' => 'Full Member',
	'init_group_13' => 'Senior Member',
	'init_group_14' => 'Gold Member',
	'init_group_15' => 'Veteran',

	'init_rank_1' => 'ผู้เริ่มต้น',
	'init_rank_2' => 'โพสต์มือใหม่',
	'init_rank_3' => 'โพสต์มือสมัครเล่น',
	'init_rank_4' => 'โพสต์มืออาชีพ',
	'init_rank_5' => 'โพสต์มือฉมัง',

	'init_cron_1' => 'เคลียร์จำนวนโพสต์ในวันนี้',
	'init_cron_2' => 'อัปเดตยกยอดเวลาออนไลน์',
	'init_cron_3' => 'เคลียร์ข้อมูลประจำวัน',
	'init_cron_4' => 'สถิติ และอีเมลอวยพรวันคล้ายวันเกิด',
	'init_cron_5' => 'กู้คืนข้อความ',
	'init_cron_6' => 'เคลียร์ประกาศ',
	'init_cron_7' => 'อัปเดตหัวข้อที่หมดอายุ',
	'init_cron_8' => 'เคลียร์ข้อมูลการโปรโมทเว็บ',
	'init_cron_9' => 'เคลียร์กระทู้ประจำเดือน',
	'init_cron_10' => 'X-Space อัปเดตสมาชิกวันนี้',
	'init_cron_11' => 'อัปเดตหัวข้อสัปดาห์นี้',

	'init_bbcode_1' => 'เนื้อหาจะเลื่อนในแนวนอน ผลลัพท์จะคล้ายกับ HTML marquee หมายเหตุ: ผลลัพท์นี้มีผลแสดงบน Internet Explorer เท่านั้น',
	'init_bbcode_2' => 'ใส่ Flash แอนนิเมชั่น',
	'init_bbcode_3' => 'แสดงสถานะ QQ ออนไลน์ คลิกที่ไอคอนของเขา(เธอ) เพื่อสนทนา',
	'init_bbcode_4' => 'ตัวยก',
	'init_bbcode_5' => 'ตัวห้อย',
	'init_bbcode_6' => 'ใส่เสียง Windows media',
	'init_bbcode_7' => 'ใส่เสียงหรือวีดีโอ Windows media',

	'init_qihoo_searchboxtxt' =>'ใส่คำที่ต้องการค้นหา สำหรับค้นหาอย่างรวดเร็วในเว็บไซต์นี้',
	'init_threadsticky' =>'ปักหมุด เห็นทุกเว็บบอร์ด,ปักหมุด เห็นเฉพาะหมวดหมู่นี้,ปักหมุด เห็นเฉพาะห้องนี้',

	'init_default_style' => 'สไตล์เริ่มต้น',
	'init_default_forum' => 'เว็บบอร์ดตัวอย่าง',
	'init_default_template' => 'ชุดเทมเพลตเริ่มต้น',
	'init_default_template_copyright' => 'Discuz!',

	'init_dataformat' => 'Y-n-j',
	'init_modreasons' => 'โพสต์โฆษณา\r\nสแปมโพสต์\r\nโพสต์ไม่เข้ากับเนื้อหา\r\nโพสต์ผิดห้อง\r\n\r\nถูกใจ\r\nรักเลย\r\nฮ่าๆ\r\nว้าว\r\nเศร้า\r\nโกรธ',
	'init_userreasons' => 'ถูกใจ\r\nรักเลย\r\nห่วงใย\r\nฮ่าๆ\r\nว้าว\r\nเศร้า\r\nโกรธ',
	'init_link' => 'เว็บไซต์ Discuz! อย่างเป็นทางการ',
	'init_link_note' => 'นำเสนอข่าวสารเกี่ยวกับผลิตภัณฑ์ Discuz! รวมไปถึงการดาวน์โหลดซอฟต์แวร์และการแลกเปลี่ยนข้อมูลเทคโนโลยีใหม่ล่าสุด',

	'init_promotion_task' => 'กิจกรรมโปรโมทเว็บไซต์',
	'init_gift_task' => 'กิจกรรมกล่องของขวัญ',
	'init_avatar_task' => 'กิจกรรมเปลี่ยนรูปโปรไฟล์',

	'copyright' => '&copy; 2001-'.date('Y').' <a href="https://code.dismall.com/" target="_blank">Discuz! Team</a>.',

	'license' => '
<div class="license"><h1>สัญญาอนุญาตให้ใช้สิทธิฉบับแปลภาษาไทย มีผลบังคับใช้กับผู้ใช้ชาวจีน</h1>
<p>ลิขสิทธิ์ (c) 2001-'.date('Y').' บริษัท เทนเซ็นต์ คลาวด์ คอมพิวติ้ง (ปักกิ่ง) จำกัด สงวนลิขสิทธิ์</p>

<p>ขอขอบคุณที่เลือกใช้ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ หวังว่าความตั้งใจของเราจะมอบโซลูชันไซต์ที่มีประสิทธิภาพ รวดเร็ว ทรงพลัง และโซลูชันฟอรัมชุมชนที่มีประสิทธิภาพ เว็บไซต์ของชุมชนการสนทนาเกี่ยวกับผลิตภัณฑ์อย่างเป็นทางการคือ https://www.dismall.com เว็บไซต์อย่างเป็นทางการของศูนย์แอปพลิเคชันผลิตภัณฑ์คือ: https://addon.dismall.com โค้ดโอเพ่นซอร์สสามารถดูได้ที่ https://code.dismall.com</p>

<p>ศูนย์แอปพลิเคชันอย่างเป็นทางการที่รวมอยู่ในโครงการ Discuz! X ของผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ดำเนินการโดย Hefei Erdao Network Technology Co., Ltd. โครงการโอเพ่นซอร์ส Discuz! X ได้รับการดูแลโดย Hefei Erdao Network Technology Co., Ltd. โค้ดโอเพ่นซอร์ส Discuz! X ได้รับการดูแลร่วมกันโดยคณะกรรมการการจัดการโอเพ่นซอร์สของโครงการและนักพัฒนาชุมชน เทนเซ็นต์ คลาวด์ ให้บริการทั้งหมดยกเว้นบริการข้างต้น</p>

<p>ประกาศสำหรับผู้ใช้: ข้อตกลงนี้เป็นข้อตกลงทางกฎหมายระหว่างคุณและ เทนเซ็นต์ คลาวด์ เกี่ยวกับการใช้ผลิตภัณฑ์ซอฟต์แวร์และบริการต่าง ๆ ที่ เทนเซ็นต์ คลาวด์ จัดหาให้ ไม่ว่าคุณจะเป็นบุคคลหรือองค์กรแสวงกำไรหรือไม่ และคุณใช้งานด้วยวิธีการใด (รวมถึงเพื่อวัตถุประสงค์ในการเรียนรู้และการวิจัย) คุณต้องอ่านข้อตกลงนี้อย่างละเอียด ซึ่งรวมถึงข้อความปฏิเสธความรับผิดชอบที่ยกเว้นหรือจำกัดความรับผิดและข้อจำกัดของ เทนเซ็นต์ คลาวด์ สิทธิของคุณ กรุณาตรวจสอบและยอมรับหรือไม่ยอมรับข้อกำหนดในการให้บริการเหล่านี้ หากคุณไม่ยอมรับข้อกำหนดในการให้บริการและ/หรือการเปลี่ยนแปลงของ เทนเซ็นต์ คลาวด์ ในเวลาใด ๆ คุณไม่ควรใช้หรือยกเลิกใช้งานผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ โดยสมัครใจที่ เทนเซ็นต์ คลาวด์ ให้บริการ มิฉะนั้น การลงทะเบียน เข้าสู่ระบบ ดาวน์โหลด ดู ฯลฯ ของบริการที่เกี่ยวข้องในผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ จะถือว่าคุณยอมรับข้อกำหนดในการให้บริการเหล่านี้อย่างเต็มที่ ซึ่งรวมถึงการยอมรับการแก้ไขใด ๆ ที่ เทนเซ็นต์ คลาวด์ ดำเนินการกับข้อกำหนดในการให้บริการเมื่อใดก็ได้ตลอดเวลา</p>
<p>เมื่อข้อกำหนดในการให้บริการมีการเปลี่ยนแปลง เทนเซ็นต์ คลาวด์ จะประกาศเนื้อหาที่แก้ไขบนเว็บไซต์ เมื่อข้อกำหนดในการให้บริการฉบับแก้ไขได้รับการเผยแพร่บนระบบการจัดการเว็บไซต์ (AdminCP) เงื่อนไขเหล่านี้จะแทนที่ข้อกำหนดในการให้บริการเดิมทันที คุณสามารถตรวจสอบข้อกำหนดในการให้บริการเวอร์ชันล่าสุดได้ตลอดเวลาโดยลงชื่อเข้าใช้เว็บไซต์โค้ดโอเพนซอร์ส หากคุณเลือกที่จะยอมรับข้อกำหนดเหล่านี้ แสดงว่าคุณตกลงที่จะมีพันธะผูกพันตามข้อกำหนดของข้อตกลง หากคุณไม่ยอมรับข้อกำหนดในการให้บริการนี้ คุณจะไม่สามารถรับสิทธิ์ในการใช้บริการได้ หากคุณละเมิดข้อกำหนดเหล่านี้ เทนเซ็นต์ คลาวด์ มีสิทธิ์ที่จะระงับหรือยุติคุณสมบัติของคุณในการใช้ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ เมื่อใดก็ได้ และขอสงวนสิทธิ์ในการรับผิดชอบทางกฎหมายที่เกี่ยวข้อง</p>
<p>คุณสามารถเริ่มใช้ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ได้ก็ต่อเมื่อคุณเข้าใจ ยอมรับ และปฏิบัติตามข้อกำหนดทั้งหมดของข้อตกลงนี้เท่านั้น คุณสามารถทำข้อตกลงเป็นลายลักษณ์อักษรอื่นโดยตรงกับ เทนเซ็นต์ คลาวด์ เพื่อเสริมหรือแทนที่ทั้งหมดหรือบางส่วนของข้อตกลงนี้</p>

<p>เทนเซ็นต์ คลาวด์ เป็นเจ้าของสิทธิ์ในทรัพย์สินทางปัญญาทั้งหมดของซอฟต์แวร์นี้ ซอฟต์แวร์นี้มีไว้เพื่อสัญญาอนุญาตเท่านั้น จะไม่มีการขายใด ๆ เทนเซ็นต์ คลาวด์ อนุญาตให้คุณคัดลอก ดาวน์โหลด ติดตั้ง ใช้หรือได้รับประโยชน์อย่างอื่นจากฟังก์ชันหรือสิทธิ์ในทรัพย์สินทางปัญญาของซอฟต์แวร์นี้ตามเงื่อนไขของข้อตกลงนี้เท่านั้น</p>

<h3>I. สิทธิ์ที่ได้รับอนุญาตในข้อตกลง</h3>
<ol>
   <li>คุณสามารถใช้ซอฟต์แวร์เพื่อการใช้งานที่ไม่ใช่เชิงพาณิชย์หรือเชิงพาณิชย์ (จำกัดเฉพาะสิทธิ์ใช้งานที่ปรับให้เข้ากับข้อตกลงนี้) บนพื้นฐานของการปฏิบัติตามข้อตกลงสิทธิ์การใช้งานนี้โดยสมบูรณ์ โดยไม่ต้องชำระค่าธรรมเนียมใบอนุญาตลิขสิทธิ์ซอฟต์แวร์</li>
   <li>คุณสามารถแก้ไขซอร์สโค้ดของผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ (หากมีให้) หรือรูปแบบอินเทอร์เฟซเพื่อให้เหมาะกับข้อกำหนดของเว็บไซต์ของคุณภายในข้อจำกัดที่ระบุไว้ในข้อตกลง</li>
   <li>คุณเป็นเจ้าของข้อมูลสมาชิก บทความ และข้อมูลที่เกี่ยวข้องทั้งหมดบนเว็บไซต์ที่สร้างขึ้นโดยใช้ซอฟต์แวร์นี้ และดำเนินการตรวจสอบและให้ความสนใจกับเนื้อหาของเว็บไซต์ที่สร้างขึ้นโดยใช้ซอฟต์แวร์นี้โดยอิสระเพื่อให้แน่ใจว่าจะไม่ละเมิดต่อสิทธิ์ที่ชอบด้วยกฎหมายและผลประโยชน์ของใครก็ตาม และรับผิดชอบโดยอิสระสำหรับความรับผิดชอบทั้งหมดที่เกิดขึ้นจากการใช้ซอฟต์แวร์และบริการ เทนเซ็นต์ คลาวด์ คุณจะต้องชดใช้ค่าเสียหายทั้งหมดสำหรับความสูญเสียที่เกิดขึ้นกับบริษัทเทนเซ็นต์ คลาวด์ หรือผู้ใช้</li>
   <li>หากคุณต้องการใช้ซอฟต์แวร์หรือผู้ใช้บริการของเทนเซ็นต์ คลาวด์ เพื่อวัตถุประสงค์ทางการค้า คุณต้องปฏิบัติตามกฎหมายที่เกี่ยวข้องของสาธารณรัฐประชาชนจีน หากคุณต้องการจัดเตรียมวิธีการสนับสนุนทางเทคนิคหรือเนื้อหาการสนับสนุนทางเทคนิค กรุณาให้บริการสนับสนุนด้านเทคนิคอย่างเป็นทางการ (https://www.discuz.vip/)</li>
   <li>คุณสามารถดาวน์โหลดแอปพลิเคชันที่เหมาะสมกับเว็บไซต์ของคุณได้จากบริการศูนย์แอปพลิเคชันที่ให้บริการโดย เทนเซ็นต์ คลาวด์ แต่คุณควรชำระค่าธรรมเนียมที่เกี่ยวข้องให้กับผู้พัฒนา/เจ้าของแอปพลิเคชัน</li>
</ol>

<h3>II. ข้อผูกมัดและข้อจำกัดที่ระบุไว้ในข้อตกลง</h3>
<ol>
   <li>ซอฟต์แวร์หรือใบอนุญาตทางการค้าที่เกี่ยวข้องไม่สามารถเช่า ขาย จำนอง หรือให้อนุญาตให้ใช้สิทธิช่วงได้</li>
   <li>ไม่ว่าในกรณีใด ไม่ว่าจะมีการแก้ไขหรือตกแต่ง หรือระดับของการแก้ไข ตราบใดที่ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ทั้งหมดหรือบางส่วนถูกใช้โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร ข้อความ Powered by Discuz! ที่ส่วนท้ายของหน้าและลิงก์เว็บไซต์ (https://www.discuz.vip) และลิงก์ไปยังศูนย์แอปพลิเคชันอย่างเป็นทางการในระบบหลังบ้านของโปรแกรม (https://addon.dismall.com) ต้องถูกเก็บรักษาไว้ และไม่สามารถลบ แก้ไข หรือแทนที่ได้</li>
   <li>ห้ามพัฒนาในลักษณะเวอร์ชันลอกเลียนแบบ เวอร์ชันดัดแปลง หรือเวอร์ชันของบุคคลที่สามโดยอิงจากผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ ทั้งหมดหรือบางส่วนเพื่อการแจกจ่ายซ้ำ</li>
   <li>แอปพลิเคชันที่คุณดาวน์โหลดจากศูนย์แอปพลิเคชันจะต้องไม่ทำวิศวกรรมย้อนกลับ ประกอบย้อนกลับ ถอดรหัส ฯลฯ โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากผู้พัฒนา/เจ้าของแอปพลิเคชัน และจะไม่ถูกคัดลอก ดัดแปลง เชื่อมโยง ทำซ้ำ หรือประกอบโดยไม่ได้รับอนุญาต เผยแพร่ แชร์ พัฒนาผลิตภัณฑ์ลอกเลียนแบบ ผลงาน ฯลฯ</li>
   <li>หากคุณไม่ปฏิบัติตามข้อกำหนดของข้อตกลงนี้ การอนุญาตของคุณจะสิ้นสุดลง สิทธิ์ที่ได้รับใบอนุญาตจะถูกเพิกถอน และคุณควรรับผิดชอบทางกฎหมายที่เกี่ยวข้อง</li>
</ol>

<h3>III. การรับประกันแบบจำกัดและข้อจำกัดความรับผิดชอบ</h3>
<ol>
   <li>ซอฟต์แวร์นี้และเอกสารประกอบมีให้โดยไม่มีการชดใช้หรือการรับประกันโดยชัดแจ้งหรือโดยนัย</li>
   <li>ผู้ใช้ใช้ซอฟต์แวร์นี้โดยสมัครใจ และคุณต้องเข้าใจความเสี่ยงของการใช้ซอฟต์แวร์นี้ เราไม่ให้คำมั่นสัญญาว่าจะให้การสนับสนุนด้านเทคนิคในรูปแบบใด ๆ การรับประกันการใช้งาน และไม่รับผิดชอบต่อปัญหาที่เกิดจากการใช้ซอฟต์แวร์นี้</li>
   <li>บริษัท เทนเซ็นต์ คลาวด์ ไม่รับผิดชอบต่อบทความหรือข้อมูลในเว็บไซต์หรือฟอรัมที่สร้างขึ้นโดยใช้ซอฟต์แวร์นี้ และคุณมีหน้าที่รับผิดชอบแต่เพียงผู้เดียวสำหรับความรับผิดชอบทั้งหมด</li>
   <li>ศูนย์แอปพลิเคชันอย่างเป็นทางการไม่สามารถตรวจสอบแอปพลิเคชันที่อัปโหลดไปยังศูนย์แอปพลิเคชันโดยบุคคลที่สามอย่างครอบคลุม ดังนั้นจึงไม่รับประกันความถูกต้องตามกฎหมาย ความปลอดภัย ความสมบูรณ์ ความถูกต้อง หรือคุณภาพของแอปพลิเคชัน เมื่อคุณดาวน์โหลดแอปพลิเคชันจากศูนย์แอปพลิเคชัน คุณยอมรับที่จะดำเนินการ การตัดสินใจของคุณเอง และแบกรับความเสี่ยงทั้งหมดโดยไม่ต้องพึ่ง เทนเซ็นต์ คลาวด์ และศูนย์แอปพลิเคชันอย่างเป็นทางการ อย่างไรก็ตาม ไม่ว่าในกรณีใด ศูนย์แอปพลิเคชันอย่างเป็นทางการมีสิทธิ์หยุดให้บริการศูนย์แอปพลิเคชันตามกฎหมายและดำเนินการที่เกี่ยวข้อง ซึ่งรวมถึงแต่ไม่จำกัดเพียงการถอนการติดตั้งแอปพลิเคชันที่เกี่ยวข้อง การระงับบริการทั้งหมดหรือบางส่วน การบันทึกบันทึกที่เกี่ยวข้อง และรายงานต่อหน่วยงานที่เกี่ยวข้อง เทนเซ็นต์ คลาวด์ และศูนย์แอปพลิเคชันอย่างเป็นทางการจะไม่รับผิดชอบโดยตรง ทางอ้อมหรือร่วมกันสำหรับการสูญเสียที่อาจเกิดขึ้นกับคุณและบุคคลที่สาม</li>
   <li>เทนเซ็นต์ คลาวด์ ไม่รับประกันความตรงเวลา ความปลอดภัย และความถูกต้องของซอฟต์แวร์และบริการที่ เทนเซ็นต์ คลาวด์ จัดหาให้ และการใช้ซอฟต์แวร์และบริการอันเนื่องมาจากเหตุสุดวิสัยและปัจจัยที่อยู่นอกเหนือการควบคุมของ เทนเซ็นต์ คลาวด์ (รวมถึงการโจมตีของแฮ็กเกอร์ ไฟดับ ฯลฯ) หาก การระงับหรือการยกเลิกทำให้คุณสูญเสีย คุณยอมรับที่จะสละสิทธิ์ทั้งหมดในการดำเนินตามความรับผิดชอบของ เทนเซ็นต์ คลาวด์   </li>
   <li>บริษัท เทนเซ็นต์ คลาวด์ ดึงความสนใจของคุณไปที่ข้อเท็จจริงที่ว่าเพื่อปกป้องเอกราชของบริษัทในการพัฒนาและปรับเปลี่ยนธุรกิจบริษัท เทนเซ็นต์ คลาวด์ มีสิทธิ์ในการแก้ไขเนื้อหาบริการ ระงับหรือยุติซอฟต์แวร์และบริการบางส่วนหรือทั้งหมดได้ตลอดเวลา โดยมีหรือไม่มีการแจ้งให้ทราบล่วงหน้า การแก้ไขจะประกาศในหน้าที่เกี่ยวข้องของเว็บไซต์ เทนเซ็นต์ คลาวด์ และจะถือเป็นการแจ้งเตือนเมื่อมีการประกาศ เทนเซ็นต์ คลาวด์ จะไม่รับผิดชอบต่อคุณหรือบุคคลที่สามสำหรับความสูญเสียที่เกิดจากการใช้สิทธิ์ของ เทนเซ็นต์ คลาวด์ ในการแก้ไขหรือระงับหรือยุติซอฟต์แวร์และบริการบางส่วนหรือทั้งหมด</li>
</ol>

<p>รายละเอียดของข้อตกลงสิทธิ์การใช้งานสำหรับผู้ใช้ผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ การอนุญาตเชิงพาณิชย์ และบริการทางเทคนิคมีให้โดย เทนเซ็นต์ คลาวด์ เท่านั้น เทนเซ็นต์ คลาวด์ มีสิทธิ์แก้ไขข้อตกลงใบอนุญาตและรายการราคาบริการโดยไม่ต้องแจ้งให้ทราบล่วงหน้า และข้อตกลงที่แก้ไขหรือรายการราคาจะมีผลสำหรับผู้ใช้ที่ได้รับอนุญาตใหม่นับจากวันที่เปลี่ยนแปลง</p>

<p>เมื่อคุณเริ่มติดตั้งผลิตภัณฑ์ เทนเซ็นต์ คลาวด์ จะถือว่าคุณเข้าใจและยอมรับข้อกำหนดของข้อตกลงนี้โดยสมบูรณ์ และคุณจะต้องอยู่ภายใต้ข้อบังคับและข้อจำกัดที่เกี่ยวข้องในขณะที่เพลิดเพลินกับสิทธิ์ที่ได้รับจากข้อกำหนดข้างต้น พฤติกรรมที่อยู่นอกเหนือขอบเขตของข้อตกลงจะเป็นการละเมิดข้อตกลงสิทธิ์การใช้งานนี้โดยตรงและถือเป็นการละเมิด เรามีสิทธิ์ที่จะยุติการอนุญาตเมื่อใดก็ได้ เพื่อหยุดความเสียหาย และสงวนสิทธิ์ในการรับผิดชอบที่เกี่ยวข้อง</p>

<p>การตีความ ความถูกต้อง และการระงับข้อพิพาทของเงื่อนไขของข้อตกลงใบอนุญาตนี้จะอยู่ภายใต้กฎหมายของสาธารณรัฐประชาชนจีน</p>

<p>หากมีข้อพิพาทหรือข้อพิพาทใด ๆ ระหว่างคุณกับ เทนเซ็นต์ คลาวด์ ควรแก้ไขโดยการเจรจาฉันมิตรก่อน หากการเจรจาไม่เป็นผล คุณยินยอมอย่างเต็มที่ที่จะส่งข้อพิพาทหรือข้อพิพาทไปยังศาลประชาชนของเขตไฮเดียน กรุงปักกิ่ง ซึ่งเป็นตั้งของเทนเซ็นต์ คลาวด์ ทั้งนี้เทนเซ็นต์ คลาวด์ มีสิทธิ์ตีความและแก้ไขเนื้อหาของข้อกำหนดข้างต้น</p>

<p>(สิ้นสุดข้อความ)</p>

<p align="right">Discuz!</p>

</div>',

	'php8_tips' => 'สวัสดี ดิสคัสที่คุณกำลังติดตั้งไม่รองรับ PHP 9 กรุณาดาวน์เกรดเป็น PHP 8.0 ก่อน จากนั้นค่อยลองใหม่!',
	'no_utf8_tips' => 'สวัสดี เวอร์ชันที่คุณใช้เป็นเวอร์ชันเข้ารหัสภาษาท้องถิ่น เช่น GBK / BIG-5 ซึ่งไม่ใช่เวอร์ชันหลักสำหรับแจกจ่ายอีกต่อไป หากคุณวางแผนที่จะสร้างเว็บไซต์ใหม่ ขอแนะนำ [อย่างยิ่ง] ให้ใช้เวอร์ชันล่าสุดอย่างเป็นทางการ นั่นคือ UTF-8',
	'no_latest_tips' => 'สวัสดี คุณกำลังติดตั้งเวอร์ชันที่เก่าแล้ว และอาจมีข้อบกพร่องรวมไปถึงความเสี่ยงด้านความปลอดภัย หากเป็นไปได้ ขอแนะนำให้คุณติดตั้งเวอร์ชันภาษาไทยล่าสุดอย่างเป็นทางการจะดีกว่า',
	'unstable_tips' => 'สวัสดี คุณกำลังติดตั้งเวอร์ชันที่ไม่เป็นทางการ อาจมีบั๊กหรือปัญหาที่ไม่รู้จักได้ หากคุณวางแผนที่จะสร้างเว็บไซต์หรือซื้อปลั๊กอินใหม่ ขอแนะนำให้คุณติดตั้งเวอร์ชันภาษาไทยล่าสุดอย่างเป็นทางการจะดีกว่า',
	'next_tips' => '\r\nคลิก [ตกลง] เพื่อไปหน้าดาวน์โหลดดิสคัสภาษาไทยล่าสุด หรือคลิก [ยกเลิก] เพื่อติดตั้งต่อไป (ไม่แนะนำ)',

	'uc_installed' => 'คุณได้ติดตั้ง UCenter ไว้อยู่แล้ว หากคุณจำเป็นต้องติดตั้งใหม่ให้ลบไฟล์ data/install.lock',
	'i_agree' => 'ฉันได้อ่านและยอมรับข้อตกลงทั้งหมด',
	'supportted' => 'สนับสนุน',
	'unsupportted' => 'ไม่สนับสนุน',
	'max_size' => 'สนับสนุน/ขนาดสูงสุด',
	'project' => 'รายการ',
	'ucenter_required' => 'ขั้นต่ำ',
	'ucenter_best' => 'แนะนำ',
	'curr_server' => 'เซิร์ฟเวอร์ปัจจุบัน',
	'env_check' => 'ความต้องการของระบบ',
	'os' => 'ระบบปฏิบัติการ',
	'php' => 'เวอร์ชัน PHP',
	'attachmentupload' => 'อัปโหลดไฟล์',
	'unlimit' => 'ไม่จำกัด',
	'version' => 'เวอร์ชัน',
	'gdversion' => 'เวอร์ชัน GD',
	'allow' => 'อนุญาต',
	'unix' => 'คลาส Unix',
	'diskspace' => 'พื้นที่ดิสก์',
	'opcache' => 'OPcache',
	'curl' => 'ไลบรารี cURL',
	'priv_check' => 'ตรวจสอบสิทธิโฟลเดอร์',
	'func_depend' => 'ตรวจสอบฟังก์ชัน',
	'func_name' => 'ชื่อฟังก์ชัน',
	'check_result' => 'ผลลัพธ์การทดสอบ',
	'suggestion' => 'คำแนะนำ',
	'advice_mysqli' => 'กรุณาตรวจสอบว่าโมดูล mysqli ได้โหลดอย่างถูกต้องแล้ว',
	'advice_fopen' => 'ฟังก์ชันนี้ต้องการตัวเลือก allow_url_fopen ใน php.ini เพื่อเปิดใช้งาน กรุณาติดต่อผู้ให้บริการเพื่อตรวจสอบให้แน่ใจว่าฟีเจอร์นี้เปิดใช้งานอยู่',
	'advice_xml' => 'ตรวจสอบดูว่าสนับสนุน PHP สำหรับ XML หรือไม่ โปรดติดต่อผู้ให้บริการโฮสต์เพื่อตรวจสอบการเปิดคุณลักษณะนี้',
	'none' => 'ไม่มี',
	'undefine_func' => 'ไม่มีฟังก์ชันนี้อยู่',
	'mysqli_unsupport' => 'กรุณาตรวจสอบว่าโมดูล mysqli ได้โหลดอย่างถูกต้องแล้ว',

	'dbhost' => 'ที่อยู่เซิร์ฟเวอร์ฐานข้อมูล',
	'dbuser' => 'ชื่อผู้ใช้',
	'dbpw' => 'รหัสผ่าน',
	'dbname' => 'ชื่อฐานข้อมูล',
	'tablepre' => 'คำนำหน้าตาราง',

	'ucfounderpw' => 'รหัสผ่าน',
	'ucfounderpw2' => 'ยืนยันรหัสผ่าน',

	'clear_dir' => 'ล้างเนื้อหาในโฟล์เดอร์',
	'select_db' => 'เลือกฐานข้อมูล',
	'create_table' => 'สร้างตารางข้อมูล',
	'succeed' => 'สำเร็จ',
	'failed' => 'ไม่สำเร็จ',

	'init_table_data' => 'เริ่มต้นข้อมูลในตารางฐานข้อมูล',
	'install_data' => 'กำลังติดตั้งข้อมูล',
	'install_test_data' => 'กำลังติดตั้งข้อมูลเพิ่มเติม',

	'method_undefined' => 'ไม่กำหนดวิธี',
	'database_nonexistence' => 'ไม่พบฐานข้อมูลที่ต้องการ',
	'skip_current' => 'ข้ามขั้นตอนนี้',
	'topic' => 'หัวข้อ',
	'install_finish' => 'ติดตั้งเว็บไซต์เสร็จสมบูรณ์ ขอบคุณสำหรับการสนับสนุนของคุณ!',
	'install_finish_next' => 'ขั้นตอนต่อไป คุณสามารถ:',
	'finish_btn_admin' => 'เข้าสู่ระบบจัดการเว็บไซต์ (AdminCP)',
	'finish_btn_cloudaddon' => 'ติดตั้งปลั๊กอิน/เทมเพลต',
	'finish_btn_direct' => 'เยี่ยมชมหน้าแรกเว็บไซต์',

);

$msglang = array(
	'config_nonexistence' => 'ไม่พบไฟล์ config.inc.php ในระบบ ตัวช่วยการติดตั้งไม่สามารถดำเนินการต่อไปได้ กรุณาใช้เครื่องมือ FTP เพื่ออัปโหลดไฟล์ดังกล่าวและลองใหม่อีกครั้ง',
);

?>