<?php

/**
 * [Discuz!] (C)2001-2099 Discuz! Team
 * This is NOT a freeware, use is subject to license terms
 * https://license.discuz.vip
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}


$lang =
	[
	'hello' => 'สวัสดี',
	'moderate_member_invalidate' => 'ปฏิเสธ',
	'moderate_member_delete' => 'ลบ',
	'moderate_member_validate' => 'อนุมัติ',

	'comma' => '，',
	'show_sender' => 'อีเมลฉบับนี้ส่งโดย {$var[\'bbname\']}',
	'show_reason' => 'คุณได้รับอีเมลฉบับนี้เนื่องจาก',
	'have_not_visit' => 'หากคุณไม่เคยเข้าชม {$var[\'bbname\']}',
	'have_not_do_this' => 'หรือไม่ได้ดำเนินการตามที่ระบุไว้ข้างต้น',
	'not_interested' => 'หากคุณไม่สนใจข้อมูลนี้',
	'ignore_email' => 'โปรดเพิกเฉยต่ออีเมลฉบับนี้',
	'no_more_action' => 'คุณไม่จำเป็นต้องยกเลิกการลงทะเบียนหรือดำเนินการอื่น ๆ เพิ่มเติม',
	'important' => 'สำคัญ!',
	'if_not_link' => 'หากลิงก์ด้านบนไม่สามารถคลิกได้ โปรดคัดลอกที่อยู่ URL ไปวางในแถบที่อยู่ของเบราว์เซอร์เพื่อเข้าชมด้วยตนเอง',
	'msg_start' => '--- เริ่มต้นข้อความต้นฉบับ ---',
	'msg_end' => '--- สิ้นสุดข้อความต้นฉบับ ---',
	'not_responsible' => 'ทีมผู้ดูแลเว็บไซต์จะไม่รับผิดชอบต่ออีเมลลักษณะนี้ (ที่ส่งโดยผู้ใช้รายอื่น)',
	'show_ip' => 'ไอพี (IP) ของผู้ส่งคำขอนี้คือ {$var[\'clientip\']}',
	'welcome_visit' => 'ยินดีต้อนรับเข้าสู่ {$_G[\'setting\'][\'bbname\']}',
	'thanks_for_visit' => 'ขอบคุณที่เข้าชม ขอให้คุณมีความสุขกับการใช้งานครับ!',
	'sincerely' => 'ขอแสดงความนับถือ',
	'admin_team' => 'ทีมผู้ดูแล {$var[\'bbname\']}',


	'get_passwd_subject' => 'คำแนะนำในการกู้คืนรหัสผ่าน',
	'get_passwd_reason' => 'ที่อยู่อีเมลนี้ถูกใช้ลงทะเบียนใน {$var[\'bbname\']} และผู้ใช้งานบัญชีนี้ได้ส่งคำขอใช้ฟังก์ชันกู้คืนรหัสผ่านผ่านอีเมล',
	'get_passwd_if_not' => 'หากคุณไม่ได้ส่งคำขอรีเซ็ตรหัสผ่าน หรือไม่ใช่สมาชิกของ {$var[\'bbname\']} โปรดเพิกเฉยและลบอีเมลฉบับนี้ทันที โปรดอ่านเนื้อหาด้านล่างต่อเมื่อคุณยืนยันว่าต้องการรีเซ็ตรหัสผ่านเท่านั้น',
	'get_passwd_explain' => 'คำอธิบายการรีเซ็ตรหัสผ่าน',
	'get_passwd_click_link' => 'คุณเพียงแค่คลิกที่ลิงก์ด้านล่างเพื่อรีเซ็ตรหัสผ่านของคุณ (ลิงก์มีอายุการใช้งาน 3 วันหลังจากส่งคำขอ):',
	'get_passwd_new_pwd' => 'เมื่อเปิดลิงก์ด้านบนแล้ว ให้กรอกรหัสผ่านใหม่และยืนยัน จากนั้นคุณจะสามารถใช้รหัสผ่านใหม่เพื่อเข้าสู่เว็บไซต์ได้ทันที ทั้งนี้คุณสามารถเปลี่ยนรหัสผ่านได้ตลอดเวลาในเมนูตั้งค่าส่วนตัว',

	'password_reset_subject' => 'แจ้งการเปลี่ยนแปลงรหัสผ่าน',
	'password_reset_reason' => 'อีเมลนี้ถูกใช้ลงทะเบียนใน {$var[\'bbname\']} และผู้ใช้งานบัญชีนี้ได้ดำเนินการรีเซ็ตหรือเปลี่ยนแปลงรหัสผ่านเรียบร้อยแล้ว',
	'password_reset_if_not' => 'หากคุณไม่ใช่สมาชิกของ {$var[\'bbname\']} โปรดเพิกเฉยและลบอีเมลฉบับนี้ทันที โปรดอ่านเนื้อหาด้านล่างต่อเมื่อคุณเป็นสมาชิกของ {$var[\'bbname\']} เท่านั้น',
	'password_reset_explain' => 'บัญชีผู้ใช้ของคุณที่ชื่อ {$var[\'username\']} ในเว็บไซต์ {$var[\'bbname\']} ได้รับการเปลี่ยนหรือรีเซ็ตรหัสผ่านเมื่อวันที่ {$var[\'datetime\']}',
	'password_reset_if_not_user_op' => 'หากคุณไม่ได้เป็นผู้ดำเนินการเปลี่ยนรหัสผ่านด้วยตนเอง โปรดเข้าสู่ระบบ {$var[\'bbname\']} ทันทีเพื่อตรวจสอบความปลอดภัยและเปลี่ยนรหัสผ่านใหม่อีกครั้ง',
	'password_reset_if_not_user_op_help' => 'หากคุณมีข้อสงสัยหรือต้องการความช่วยเหลือ (เช่น การระงับบัญชีชั่วคราว) โปรดติดต่อทีมผู้ดูแล {$var[\'bbname\']} เพื่อขอรับการสนับสนุน',

	'email_verify_subject' => 'การยืนยันที่อยู่อีเมล',
	'email_verify_reason' => 'มีการลงทะเบียนสมาชิกใหม่ใน {$var[\'bbname\']} หรือผู้ใช้งานได้แก้ไขที่อยู่อีเมลโดยใช้ที่อยู่นี้',
	'email_verify_explain' => 'คำแนะนำในการเปิดใช้งานบัญชี',
	'email_verify_explain2' => 'หากคุณเป็นสมาชิกใหม่ของ {$var[\'bbname\']} หรือได้เปลี่ยนอีเมลในระบบเป็นที่อยู่นี้ เราจำเป็นต้องตรวจสอบความถูกต้องของอีเมลเพื่อป้องกันอีเมลขยะหรือการแอบอ้างใช้งานที่อยู่ของคุณ',
	'email_verify_click_link' => 'คุณเพียงแค่คลิกที่ลิงก์ด้านล่างเพื่อเปิดใช้งานบัญชีของคุณ:',

	'email_reset_subject' => 'แจ้งการเปลี่ยนแปลงที่อยู่อีเมล',
	'email_reset_reason' => 'ที่อยู่อีเมลนี้ถูกใช้ลงทะเบียนใน {$var[\'bbname\']} และผู้ใช้งานได้ดำเนินการขอเปลี่ยนที่อยู่อีเมล',
	'email_reset_if_not' => 'หากคุณไม่ใช่สมาชิกของ {$var[\'bbname\']} โปรดเพิกเฉยและลบอีเมลฉบับนี้ทันที โปรดอ่านเนื้อหาด้านล่างต่อเมื่อคุณเป็นสมาชิกของ {$var[\'bbname\']} เท่านั้น',
	'email_reset_explain' => 'บัญชีผู้ใช้ของคุณที่ชื่อ {$var[\'username\']} ในเว็บไซต์ {$var[\'bbname\']} ได้รับการเปลี่ยนที่อยู่อีเมลเมื่อวันที่ {$var[\'datetime\']}',
	'email_reset_new_email' => 'ที่อยู่อีเมลใหม่คือ: {$var[\'email\']} ส่งคำขอเมื่อวันที่: {$var[\'request_datetime\']}',
	'email_reset_if_not_user_op' => 'หากคุณไม่ได้เป็นผู้ดำเนินการเปลี่ยนอีเมลด้วยตนเอง โปรดเข้าสู่ระบบ {$var[\'bbname\']} ทันทีเพื่อตรวจสอบความปลอดภัย รวมถึงเปลี่ยนรหัสผ่านและอีเมลกลับเป็นค่าเดิม',
	'email_reset_if_not_user_op_help' => 'หากคุณมีข้อสงสัยหรือต้องการความช่วยเหลือ (เช่น การระงับบัญชีชั่วคราว) โปรดติดต่อทีมผู้ดูแล {$var[\'bbname\']} เพื่อขอรับการสนับสนุน',

	'secmobile_reset_subject' => 'แจ้งการเปลี่ยนแปลงหมายเลขโทรศัพท์มือถือที่ปลอดภัย',
	'secmobile_reset_reason' => 'ที่อยู่อีเมลนี้ถูกใช้ลงทะเบียนใน {$var[\'bbname\']} และผู้ใช้งานได้ดำเนินการเปลี่ยนหมายเลขโทรศัพท์มือถือที่ใช้เพื่อความปลอดภัย',
	'secmobile_reset_if_not' => 'หากคุณไม่ใช่สมาชิกของ {$var[\'bbname\']} โปรดเพิกเฉยและลบอีเมลฉบับนี้ทันที โปรดอ่านเนื้อหาด้านล่างต่อเมื่อคุณเป็นสมาชิกของ {$var[\'bbname\']} เท่านั้น',
	'secmobile_reset_explain' => 'บัญชีผู้ใช้ของคุณที่ชื่อ {$var[\'username\']} ในเว็บไซต์ {$var[\'bbname\']} ได้รับการเปลี่ยนหมายเลขโทรศัพท์มือถือเมื่อวันที่ {$var[\'datetime\']}',
	'secmobile_reset_new_secmobile' => 'หมายเลขโทรศัพท์ใหม่คือ: {$var[\'secmobile\']}',
	'secmobile_reset_if_not_user_op' => 'หากคุณไม่ได้เป็นผู้ดำเนินการเปลี่ยนหมายเลขโทรศัพท์ด้วยตนเอง โปรดเข้าสู่ระบบ {$var[\'bbname\']} ทันทีเพื่อตรวจสอบความปลอดภัย รวมถึงเปลี่ยนรหัสผ่านและหมายเลขโทรศัพท์กลับเป็นค่าเดิม',
	'secmobile_reset_if_not_user_op_help' => 'หากคุณมีข้อสงสัยหรือต้องการความช่วยเหลือ (เช่น การระงับบัญชีชั่วคราว) โปรดติดต่อทีมผู้ดูแล {$var[\'bbname\']} เพื่อขอรับการสนับสนุน',

	'email_register_subject' => 'ลิงก์ลงทะเบียนสมาชิกเว็บไซต์',
	'email_register_reason' => 'มีการขอลิงก์สำหรับลงทะเบียนสมาชิกใหม่ใน {$var[\'bbname\']} โดยใช้ที่อยู่อีเมลนี้',
	'email_register_explain' => 'คำแนะนำสำหรับการลงทะเบียนสมาชิกใหม่',
	'email_register_click_link' => 'คุณเพียงแค่คลิกที่ลิงก์ด้านล่างเพื่อดำเนินการลงทะเบียนสมาชิก (ลิงก์นี้มีอายุการใช้งาน 3 วัน หากหมดอายุคุณสามารถส่งคำขอใหม่ได้):',

	'add_member_subject' => 'คุณได้รับการเพิ่มเป็นสมาชิกใหม่เรียบร้อยแล้ว',
	'add_member_intro' => 'สวัสดีครับ ผมคือ {$var[\'adminusername\']} หนึ่งในทีมผู้ดูแลของ {$var[\'bbname\']}',
	'add_member_reason' => 'คุณเพใจได้รับการเพิ่มเป็นสมาชิกของ {$var[\'bbname\']} โดยใช้อีเมลนี้เป็นที่อยู่สำหรับเข้าใช้งาน',
	'add_member_no_interest' => 'หากคุณไม่สนใจ หรือไม่มีความประสงค์จะเป็นสมาชิกของ {$var[\'bbname\']}',
	'add_member_info' => 'ข้อมูลบัญชีผู้ใช้',
	'add_member_bbname' => 'ชื่อเว็บไซต์: ',
	'add_member_siteurl' => 'ที่อยู่เว็บไซต์: ',
	'add_member_newusername' => 'ชื่อผู้ใช้: ',
	'add_member_newpassword' => 'รหัสผ่าน: ',
	'add_member_can_login' => 'จากนี้ไปคุณสามารถใช้ข้อมูลดังกล่าวเข้าสู่ระบบ {$var[\'bbname\']} ได้ทันที ขอให้สนุกกับการใช้งานครับ!',

	'birthday_subject' => 'สุขสันต์วันเกิดแด่คุณ!',
	'birthday_reason' => 'ที่อยู่อีเมลนี้ถูกใช้ลงทะเบียนใน {$var[\'bbname\']}<br />
และตามข้อมูลที่คุณได้ระบุไว้ วันนี้เป็นวันเกิดของคุณ เราจึงขอมอบคำอวยพรในโอกาสพิเศษนี้<br />
ในนามของทีมผู้ดูแล {$var[\'bbname\']} ขอให้คุณมีความสุขมาก ๆ ในวันเกิดปีนี้ครับ',
	'birthday_if_not' => 'หากคุณไม่ใช่สมาชิกของ {$var[\'bbname\']} หรือวันนี้ไม่ใช่วันเกิดของคุณ อาจเกิดจากการระบุที่อยู่อีเมลหรือข้อมูลวันเกิดผิดพลาด อีเมลฉบับนี้จะถูกส่งเพียงครั้งเดียวต่อปีเท่านั้น',


	'email_to_friend_subject' => '{$_G[\'member\'][\'username\']} แนะนำเนื้อหา: {$thread[\'subject\']} ให้กับคุณ',
	'email_to_friend_sender' => 'อีเมลฉบับนี้ส่งโดยคุณ {$_G[\'member\'][\'username\']} จากเว็บไซต์ {$_G[\'setting\'][\'bbname\']}',
	'email_to_friend_reason' => 'คุณ {$_G[\'member\'][\'username\']} ได้ใช้ฟังก์ชัน "แนะนำเพื่อน" ของ {$_G[\'setting\'][\'bbname\']} เพื่อแนะนำเนื้อหาต่อไปนี้ให้แก่คุณ',
	'email_to_friend_not_official' => 'โปรดทราบว่าอีเมลนี้ถูกส่งโดยผู้ใช้งานผ่านระบบแนะนำ ไม่ใช่อีเมลประกาศอย่างเป็นทางการจากเว็บไซต์',

	'email_to_invite_subject' => 'เพื่อนของคุณ {$_G[\'member\'][\'username\']} ได้ส่งรหัสเชิญลงทะเบียนสมาชิก {$_G[\'setting\'][\'bbname\']} ให้แก่คุณ',
	'email_to_invite_reason' => 'คุณ {$_G[\'member\'][\'username\']} ได้ใช้ฟังก์ชัน "ส่งรหัสเชิญให้เพื่อน" ของ {$var[\'bbname\']} เพื่อแนะนำเนื้อหาต่อไปนี้ให้แก่คุณ',
	'email_to_invite_not_official' => 'โปรดทราบว่าอีเมลนี้ถูกส่งโดยผู้ใช้งานผ่านระบบเชิญ ไม่ใช่อีเมลประกาศอย่างเป็นทางการจากเว็บไซต์',

	'invitemail_subject' => '{username} เชิญคุณเข้าร่วม {sitename} และเป็นเพื่อนกัน',
	'invitemail_from' => 'สวัสดีครับ ผมคือ {$var[\'username\']} ขอเชิญคุณเข้าร่วมเป็นส่วนหนึ่งของ {$var[\'sitename\']} และเป็นเพื่อนกับผมที่นี่',
	'invitemail_reason' => 'เมื่อเข้าร่วมเป็นเพื่อนกับผมแล้ว คุณจะสามารถติดตามความเคลื่อนไหว แลกเปลี่ยนความคิดเห็น และติดต่อสื่อสารกับผมได้ตลอดเวลาครับ',
	'invitemail_start' => 'ข้อความจากผู้เชิญ: ',
	'invitemail_accept_invite' => 'โปรดคลิกที่ลิงก์ด้านล่างเพื่อตอบรับคำเชิญเป็นเพื่อน: ',
	'invitemail_viewpage' => 'หากคุณมีบัญชีใน {$var[\'sitename\']} อยู่แล้ว คุณสามารถคลิกที่ลิงก์ด้านล่างเพื่อเข้าชมโปรไฟล์ของผมได้ทันที: ',

	'moderate_member_invalidate' => 'ปฏิเสธ',
	'moderate_member_delete' => 'ลบ',
	'moderate_member_validate' => 'อนุมัติ',
	'moderate_member_subject' => 'แจ้งผลการตรวจสอบสมาชิก',
	'moderate_member_reason' => 'ที่อยู่อีเมลนี้ถูกใช้ลงทะเบียนสมาชิกใหม่ใน {$var[\'bbname\']} ซึ่งทางผู้ดูแลระบบได้ตั้งค่าให้มีการคัดกรองสมาชิกใหม่ด้วยตนเอง อีเมลฉบับนี้คือการแจ้งผลการตรวจสอบใบลงทะเบียนของคุณ',
	'moderate_member_info' => 'ข้อมูลการลงทะเบียนและผลการตรวจสอบ',
	'moderate_member_username' => 'ชื่อผู้ใช้: ',
	'moderate_member_regdate' => 'เวลาที่ลงทะเบียน: ',
	'moderate_member_submitdate' => 'เวลาที่ส่งตรวจสอบ: ',
	'moderate_member_submittimes' => 'จำนวนครั้งที่ส่งตรวจสอบ: ',
	'moderate_member_msg' => 'เหตุผลในการลงทะเบียน: ',
	'moderate_member_modresult' => 'ผลการคัดกรอง: ',
	'moderate_member_moddate' => 'เวลาที่ตรวจสอบ: ',
	'moderate_member_adminusername' => 'ผู้ดูแลที่ตรวจสอบ: ',
	'moderate_member_remark' => 'ข้อความจากผู้ดูแล: ',
	'moderate_member_explain' => 'คำอธิบายผลการตรวจสอบ',
	'moderate_member_explain1' => 'ผ่าน: การลงทะเบียนของคุณได้รับการอนุมัติเรียบร้อยแล้ว ตอนนี้คุณเป็นสมาชิกอย่างเป็นทางการของ {$var[\'bbname\']}',
	'moderate_member_explain2' => 'ปฏิเสธ: ข้อมูลการลงทะเบียนของคุณไม่ครบถ้วน หรือไม่เป็นไปตามเงื่อนไขที่เรากำหนด คุณสามารถแก้ไขข้อมูลตามข้อความจากผู้ดูแลได้ที่ <a href="home.php?mod=spacecp&ac=profile" target="_blank">แก้ไขข้อมูลส่วนตัว</a> แล้วส่งตรวจสอบอีกครั้ง',
	'moderate_member_explain3' => 'ลบ: คำขอลงทะเบียนของคุณถูกปฏิเสธเนื่องจากข้อมูลไม่ตรงตามเงื่อนไขอย่างมาก หรือมีสมาชิกใหม่เกินขีดจำกัด บัญชีของคุณถูกลบออกจากฐานข้อมูลแล้ว และจะไม่สามารถใช้ข้อมูลเดิมเพื่อเข้าสู่ระบบหรือส่งตรวจสอบได้อีก ขออภัยในความไม่สะดวก',

	'adv_expiration_subject' => 'โฆษณาบนเว็บไซต์ของคุณจะหมดอายุในอีก {day} วัน โปรดดำเนินการด่วน',
	'adv_expiration_msg' => 'โฆษณาต่อไปนี้ในเว็บไซต์ของคุณจะหมดอายุในอีก {$var[\'day\']} วัน โปรดตรวจสอบและดำเนินการตามความเหมาะสม: ',

	'invite_payment_subject' => 'การสั่งซื้อรหัสเชิญ',
	'invite_payment_msg' => 'ยินดีต้อนรับเข้าสู่ {$var[\'bbname\']} ({$var[\'siteurl\']}) รายการสั่งซื้อหมายเลข {$var[\'orderid\']} ของคุณได้รับการชำระเงินเรียบร้อยและมีผลใช้งานแล้ว',
	'invite_payment_invitecode' => 'นี่คือรหัสเชิญที่คุณได้รับ',

	'email_seccode_verify_subject' => 'การยืนยันตัวตนบัญชี',
	'email_seccode_code' => 'รหัสยืนยันของคุณคือ: ',
	'email_seccode_verify_msg' => 'นี่คือรหัสยืนยันตัวตนทางอีเมลจาก {$var[\'bbname\']} ({$var[\'siteurl\']}) รหัสนี้จะมีอายุการใช้งานเพียง {$var[\'emailinterval\']} นาทีเท่านั้น!',
	];

