<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_email.php 35030 2014-10-23 07:43:23Z laoguozhang $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}


$lang = array
(
	'hello' => 'สวัสดี',
	'moderate_member_invalidate' => 'ปฏิเสธ',
	'moderate_member_delete' => 'ลบ',
	'moderate_member_validate' => 'ผ่าน',

	'comma' => '，',
	'show_sender' => 'อีเมลฉบับนี้ส่งโดย {$var[\'bbname\']}',
	'show_reason' => 'คุณได้รับอีมลนี้ เนื่องจาก',
	'have_not_visit' => 'หากคุณยังไม่เคยเข้าเยี่ยมชม {$var[\'bbname\']} ',
	'have_not_do_this' => 'หรืออย่าดำเนินการตามข้างต้น ',
	'not_interested' => 'หากคุณไม่สนใจอีเมลฉบับนี้ ',
	'ignore_email' => 'กรุณาเพิกเฉยต่ออีเมลฉบับนี้',
	'no_more_action' => 'คุณไม่จำเป็นต้องดำเนินการใด ๆ',
	'important' => 'สำคัญ!',
	'if_not_link' => 'หากข้อความด้านบนนี้ไม่อยู่ในรูปแบบลิงก์ กรุณาวางลิงก์ลงในแถบที่อยู่ของเบราว์เซอร์และเข้าชมด้วยตนเองอีกครั้ง',
	'msg_start' => 'เริ่มต้นข้อความอีเมล',
	'msg_end' => 'สิ้นสุดข้อความอีเมล',
	'not_responsible' => 'ทีมงาน/ผู้ดูแลเว็บไซต์ไม่มีส่วนเกี่ยวข้องใด ๆ ต่ออีเมลดังกล่าว',
	'show_ip' => 'IP ของผู้ส่งคำขอนี้คือ {$var[\'clientip\']}',
	'welcome_visit' => 'ขอต้อนรับสู่ {$_G[\'setting\'][\'bbname\']}',
	'thanks_for_visit' => 'ขอขอบคุณสำหรับการเยี่ยมชมของคุณ เราหวังว่าคุณจะใช้งานอย่างมีความสุข',
	'sincerely' => 'ขอแสดงความนับถือ',
	'admin_team' => 'ทีมผู้ดูแลเว็บไซต์ {$var[\'bbname\']}',


	'get_passwd_subject' => 'คำแนะนำในการรีเซ็ตรหัสผ่าน',
	'get_passwd_reason' => 'อีเมลนี้ลงทะเบียนในเว็บไซต์ของ {$var[\'bbname\']} และผู้ใช้งานดังกล่าวได้ส่งคำขอรีเซ็ตรหัสผ่าน',
	'get_passwd_if_not' => 'หากคุณไม่ได้ส่งคำขอรีเซ็ตรหัสผ่านหรือไม่ใช่ผู้ใช้ที่ลงทะเบียนในเว็บไซต์ของ {$var[\'bbname\']} กรุณาเพิกเฉยและลบอีเมลนี้ทันที อ่านด้านล่างต่อไป เมื่อคุณยืนยันว่าคุณได้ส่งคำขอรีเซ็ตรหัสผ่านด้วยตัวคุณเอง',
	'get_passwd_explain' => 'คำแนะนำในการรีเซ็ตรหัสผ่าน',
	'get_passwd_click_link' => 'คุณจะต้องรีเซ็ตรหัสผ่านของคุณโดยการคลิกลิงก์ด้านล่างภายในสามวันหลังจากส่งคำขอ: ',
	'get_passwd_new_pwd' => 'กรอกรหัสผ่านใหม่ในหน้าเว็บที่เปิดจากการลิงก์ด้านบนและกดส่ง คุณสามารถใช้รหัสผ่านใหม่เพื่อเข้าสู่เว็บไซต์ได้ทันที คุณสามารถเปลี่ยนรหัสผ่านได้ตลอดเวลาที่เมนูการตั้งค่าผู้ใช้งาน',

	'email_verify_subject' => 'การยืนยันอีเมล',
	'email_verify_reason' => 'มีการลงทะเบียนผู้ใช้ใหม่ที่เว็บไซต์ {$var[\'bbname\']} หรือผู้ใช้ได้แก้ไขอีเมลใหม่เพื่อใช้อีเมลนี้',
	'email_verify_explain' => 'คำแนะนำการเปิดใช้งานบัญชี',
	'email_verify_explain2' => 'หากคุณเป็นผู้ใช้งานใหม่ของ {$var[\'bbname\']} หรือใช้อีเมลนี้ในการแก้ไขอีเมลที่ใช้สำหรับการลงทะเบียนของคุณ เราจำเป็นต้องตรวจสอบความถูกต้องอีเมลของคุณเพื่อหลีกเลี่ยงสแปมอีเมลหรือใช้ในทางที่ผิด',
	'email_verify_click_link' => 'คุณต้องคลิกลิงก์ด้านล่างเพื่อเปิดใช้งานบัญชีของคุณ: ',

	'email_register_subject' =>	'การลงทะเบียนอีเมลกับเว็บบอร์ด',
	'email_register_reason' => 'ที่เว็บไซต์ {$var[\'bbname\']} ได้รับข้อมูลการลงทะเบียนโดยใช้อีเมลนี้ในการลงทะเบียนกับเว็บไซต์เรา',
	'email_register_explain' => 'คำแนะนำในการลงทะเบียนผู้ใช้ใหม่',
	'email_register_click_link' => 'คุณเพียงแค่ต้องคลิกที่ลิงก์ด้านล่างเพื่อลงทะเบียนผู้ใช้ ลิงก์ด้านล่างมีอายุการใช้งาน 3 วัน เมื่อลิงก์หมดอายุ คุณสามารถขอส่งการยืนยันอีเมลใหม่ได้: ',

	'add_member_subject' => 'คุณถูกเพิ่มเป็นสมาชิกใหม่',
	'add_member_intro' => 'ฉันคือ {$var[\'adminusername\']} เป็นหนึ่งในทีมผู้ดูแลเว็บไซต์ {$var[\'bbname\']}',
	'add_member_reason' => 'คุณเพิ่งถูกเพิ่มเป็นสมาชิกของ {$var[\'bbname\']} อีเมลปัจจุบันคือ อีเมลที่เราลงทะเบียนให้คุณ',
	'add_member_no_interest' => 'หากคุณไม่สนใจหรือไม่ได้ตั้งใจจะเป็นสมาชิกเว็บไซต์ {$var[\'bbname\']}',
	'add_member_info' => 'ข้อมูลบัญชี',
	'add_member_bbname' => 'ชื่อเว็บไซต์: ',
	'add_member_siteurl' => 'ที่อยู่เว็บไซต์: ',
	'add_member_newusername' => 'ชื่อผู้ใช้: ',
	'add_member_newpassword' => 'รหัสผ่าน: ',
	'add_member_can_login' => 'จากนี้ไป คุณสามารถใช้บัญชีของคุณเพื่อเข้าสู่ระบบ {$var[\'bbname\']} ขอให้สนุกกับการใช้งานเว็บไซต์ของเรานะ',

	'birthday_subject' => 'แฮปปี้เบิร์ทเดย์ทูยู',
	'birthday_reason' => 'อีเมลนี้ลงทะเบียนเป็นอีเมลผู้ใช้ที่ {$var[\'bbname\']}<br />
	และตามข้อมูลที่คุณกรอกตอนลงทะเบียน วันนี้เป็นวันเกิดของคุณ เรามีความยินดีเป็นอย่างยิ่งที่จะอวยพรวันเกิดให้คุณในเวลานี้<br />
ในนามของผู้ดูแลเว็บไซต์ {$var[\'bbname\']} เราขออวยพรให้คุณมีความสุขมาก ๆ ในวันเกิดปีนี้ของคุณ',
	'birthday_if_not' => 'หากคุณไม่ได้เป็นสมาชิกในเว็บไซต์ {$var[\'bbname\']} หรือวันนี้ไม่ใช่วันเกิดของคุณ อาจมีคนใช้อีเมลของคุณในทางที่ผิด<br />
	หรือกรอกข้อมูลวันเกิดผิด อีเมลนี้ถูกส่งมาโดยอัตโนมัติ',

	'email_to_friend_subject' => '{$_G[\'member\'][\'username\']} ได้แนะนำให้กับคุณ: {$thread[\'subject\']}',
	'email_to_friend_sender' => 'อีเมลนี้ถูกส่งโดย {$_G[\'member\'][\'username\']} จาก {$_G[\'setting\'][\'bbname\']}',
	'email_to_friend_reason' => '{$_G[\'member\'][\'username\']} ได้แนะนำ {$_G[\'setting\'][\'bbname\']} ผ่านฟังก์ชัน "กระทู้แนะนำ" เนื้อหาต่อไปนี้ให้กับคุณ',
	'email_to_friend_not_official' => 'โปรดทราบว่าผู้ใช้ส่งอีเมลนี้โดยใช้ "กระทู้แนะนำ" เท่านั้น ไม่ใช่อีเมลทางการของเว็บไซต์',

	'email_to_invite_subject' => 'เพื่อนของคุณ {$_G[\'member\'][\'username\']} ได้ส่งคำเชิญลงทะเบียนเว็บไซต์ {$_G[\'setting\'][\'bbname\']} ให้กับคุณ',
	'email_to_invite_reason' => ' {$_G[\'member\'][\'username\']} ได้แนะนำเนื้อหาต่อไปนี้ผ่านฟังก์ชัน “ส่งคำเชิญให้เพื่อน” ของเว็บไซต์ {$var[\'bbname\']} ถึงคุณ',
	'email_to_invite_not_official' => 'โปรดทราบว่าผู้ใช้ส่งอีเมลนี้โดยใช้ "ส่งคำเชิญให้เพื่อน" เท่านั้น ไม่ใช่อีเมลทางการของเว็บไซต์',

	'invitemail_subject' => '{username} เชิญคุณเข้าร่วม {sitename} และเป็นเพื่อนกัน',
	'invitemail_from' => 'สวัสดี, ฉันคือ {$var[\'username\']} ขอเชิญคุณเข้าร่วมเว็บไซต์ {$var[\'sitename\']} และมาเป็นเพื่อนกันนะ',
	'invitemail_reason' => 'เรามาเป็นเพื่อนกัน คุณจะสามารถทราบถึงอัปเดตล่าสุดองฉัน พูดคุย/สื่อสารกับฉัน และติดต่อกับฉันได้ตลอดเวลาเลยนะ',
	'invitemail_start' => 'ลิงก์คำเชิญ: ',
	'invitemail_accept_invite' => 'กรุณาคลิกลิงก์ต่อไปนี้เพื่อตอบรับคำเชิญการเป็นเพื่อน: ',
	'invitemail_viewpage' => 'หากคุณมีบัญชีเว็บไซต์ {$var[\'sitename\']} อยู่แล้ว กรุณาคลิกลิงก์ต่อไปนี้เพื่อดูหน้าโปรไฟล์ของฉัน: ',

	'moderate_member_subject' => 'แจ้งผลการตรวจสอบผู้ใช้งาน',
	'moderate_member_reason' => 'อีเมลนี้ถูกใช้โดยผู้ใช้ใหม่เพื่อลงทะเบียนกับเว็บไซต์ {$var[\'bbname\']} และผู้ดูแลระบบได้ตั้งค่าให้มีการยืนยันการลงทะเบียนของผู้ใช้ใหม่ผ่านอีเมล อีเมลนี้จะแจ้งให้คุณทราบว่าใครเป็นผู้ส่งการลงทะเบียน ผลการตรวจสอบ',
	'moderate_member_info' => 'ข้อมูลการลงทะเบียนและผลการตรวจสอบ',
	'moderate_member_username' => 'ชื่อผู้ใช้: ',
	'moderate_member_regdate' => 'เวลาลงทะเบียน: ',
	'moderate_member_submitdate' => 'วันที่ส่ง: ',
	'moderate_member_submittimes' => 'เวลาที่ส่ง: ',
	'moderate_member_msg' => 'เหตุผลในการลงทะเบียน: ',
	'moderate_member_modresult' => 'ผลการตรวจสอบ: ',
	'moderate_member_moddate' => 'วันที่ตรวจสอบ:',
	'moderate_member_adminusername' => 'ผู้ดูแลระบบที่ตรวจสอบ: ',
	'moderate_member_remark' => 'หมายเหตุของผู้ดูแลระบบ: ',
	'moderate_member_explain' => 'คำอธิบายผลการตรวจสอบ',
	'moderate_member_explain1' => 'ผ่าน: การลงทะเบียนของคุณได้รับการอนุมัติ และคุณได้กลายเป็นส่วนหนึ่งของผู้ใช้งานอย่างเป็นทางการในเว็บไซต์ {$var[\'bbname\']} เรียบร้อยแล้ว',
	'moderate_member_explain2' => 'ปฏิเสธ: ข้อมูลการลงทะเบียนของคุณไม่สมบูรณ์ หรือไม่ตรงตามข้อกำหนดของเราสำหรับผู้ใช้ใหม่ คุณสามารถฝากข้อความถึงผู้ดูแลระบบได้ที่ <a href="home.php?mod=spacecp&ac=profile" target="_blank">กรอกข้อมูลการลงทะเบียนของคุณ</a> แล้วส่งเรื่องใหม่อีกครั้ง',
	'moderate_member_explain3' => 'ลบออก: การลงทะเบียนของคุณถูกปฏิเสธเนื่องจากการหลีกเลี่ยงจากข้อกำหนดของเราอย่างมาก หรือจำนวนการลงทะเบียนใหม่บนเว็บไซต์นี้เกินกำหนดไว้ บัญชีของคุณถูกลบออกจากฐานข้อมูลแล้ว คุณจะไม่สามารถใช้เพื่อเข้าสู่ระบบหรือส่งเพื่อตรวจสอบอีกครั้งได้ ขอขอบคุณที่เข้าใจ',

	'adv_expiration_subject' =>	'โฆษณาบนไซต์ของคุณจะหมดอายุในอีก {day} วัน กรุณารีบดำเนินการโดยทันที',
	'adv_expiration_msg' =>	'โฆษณาต่อไปนี้บนไซต์ของคุณจะหมดอายุในอีก {$var[\'day\']} วัน กรุณารีบดำเนินการโดยทันที',
);

?>